// Auto-generated locations and coordinates file
const THAI_REGIONS = [
  "ภาคเหนือ",
  "ภาคตะวันออกเฉียงเหนือ",
  "ภาคกลาง",
  "ภาคตะวันออก",
  "ภาคตะวันตก",
  "ภาคใต้"
];

const THAI_REGIONS_COORDS = {
  "ภาคเหนือ": {
    "lat": 18.788,
    "lng": 98.985
  },
  "ภาคตะวันออกเฉียงเหนือ": {
    "lat": 16.441,
    "lng": 102.836
  },
  "ภาคกลาง": {
    "lat": 13.756,
    "lng": 100.501
  },
  "ภาคตะวันออก": {
    "lat": 13.116,
    "lng": 101.624
  },
  "ภาคตะวันตก": {
    "lat": 14.021,
    "lng": 99.531
  },
  "ภาคใต้": {
    "lat": 8.084,
    "lng": 98.906
  }
};

const WORLD_COUNTRIES = [
  {
    "name": "ไทย",
    "lat": 13.736,
    "lng": 100.523
  },
  {
    "name": "สหรัฐอเมริกา",
    "lat": 37.09,
    "lng": -95.712
  },
  {
    "name": "ญี่ปุ่น",
    "lat": 36.204,
    "lng": 138.252
  },
  {
    "name": "เกาหลีใต้",
    "lat": 35.907,
    "lng": 127.766
  },
  {
    "name": "จีน",
    "lat": 35.861,
    "lng": 104.195
  },
  {
    "name": "สหราชอาณาจักร",
    "lat": 55.378,
    "lng": -3.436
  },
  {
    "name": "ออสเตรเลีย",
    "lat": -25.274,
    "lng": 133.775
  },
  {
    "name": "สิงคโปร์",
    "lat": 1.352,
    "lng": 103.82
  },
  {
    "name": "มาเลเซีย",
    "lat": 4.21,
    "lng": 101.975
  },
  {
    "name": "เวียดนาม",
    "lat": 14.058,
    "lng": 108.277
  },
  {
    "name": "ลาว",
    "lat": 19.856,
    "lng": 102.495
  },
  {
    "name": "กัมพูชา",
    "lat": 12.565,
    "lng": 104.99
  },
  {
    "name": "พม่า",
    "lat": 21.916,
    "lng": 95.956
  },
  {
    "name": "อินโดนีเซีย",
    "lat": -0.789,
    "lng": 113.921
  },
  {
    "name": "ฟิลิปปินส์",
    "lat": 12.879,
    "lng": 121.774
  },
  {
    "name": "อินเดีย",
    "lat": 20.593,
    "lng": 78.962
  },
  {
    "name": "เยอรมนี",
    "lat": 51.165,
    "lng": 10.451
  },
  {
    "name": "ฝรั่งเศส",
    "lat": 46.227,
    "lng": 2.213
  }
];

const THAI_PROVINCES = [
  {
    "name": "กรุงเทพมหานคร",
    "region": "ภาคกลาง",
    "lat": 13.7565,
    "lng": 100.5551
  },
  {
    "name": "กำแพงเพชร",
    "region": "ภาคกลาง",
    "lat": 16.3677,
    "lng": 99.6501
  },
  {
    "name": "ชัยนาท",
    "region": "ภาคกลาง",
    "lat": 15.1511,
    "lng": 100.0795
  },
  {
    "name": "นครนายก",
    "region": "ภาคกลาง",
    "lat": 14.1837,
    "lng": 101.1284
  },
  {
    "name": "นครปฐม",
    "region": "ภาคกลาง",
    "lat": 13.8765,
    "lng": 100.1236
  },
  {
    "name": "นครสวรรค์",
    "region": "ภาคกลาง",
    "lat": 15.6787,
    "lng": 100.1871
  },
  {
    "name": "นนทบุรี",
    "region": "ภาคกลาง",
    "lat": 13.8922,
    "lng": 100.4318
  },
  {
    "name": "ปทุมธานี",
    "region": "ภาคกลาง",
    "lat": 14.0481,
    "lng": 100.6296
  },
  {
    "name": "พระนครศรีอยุธยา",
    "region": "ภาคกลาง",
    "lat": 14.3744,
    "lng": 100.5319
  },
  {
    "name": "พิจิตร",
    "region": "ภาคกลาง",
    "lat": 16.2581,
    "lng": 100.3585
  },
  {
    "name": "พิษณุโลก",
    "region": "ภาคกลาง",
    "lat": 16.8767,
    "lng": 100.382
  },
  {
    "name": "ลพบุรี",
    "region": "ภาคกลาง",
    "lat": 15.0339,
    "lng": 100.8033
  },
  {
    "name": "สมุทรปราการ",
    "region": "ภาคกลาง",
    "lat": 13.6197,
    "lng": 100.6638
  },
  {
    "name": "สมุทรสงคราม",
    "region": "ภาคกลาง",
    "lat": 13.4303,
    "lng": 99.9552
  },
  {
    "name": "สมุทรสาคร",
    "region": "ภาคกลาง",
    "lat": 13.5867,
    "lng": 100.2175
  },
  {
    "name": "สระบุรี",
    "region": "ภาคกลาง",
    "lat": 14.5582,
    "lng": 100.891
  },
  {
    "name": "สิงห์บุรี",
    "region": "ภาคกลาง",
    "lat": 14.8873,
    "lng": 100.3588
  },
  {
    "name": "สุพรรณบุรี",
    "region": "ภาคกลาง",
    "lat": 14.5397,
    "lng": 100.0095
  },
  {
    "name": "สุโขทัย",
    "region": "ภาคกลาง",
    "lat": 17.1564,
    "lng": 99.7947
  },
  {
    "name": "อุทัยธานี",
    "region": "ภาคกลาง",
    "lat": 15.371,
    "lng": 99.7926
  },
  {
    "name": "อ่างทอง",
    "region": "ภาคกลาง",
    "lat": 14.6128,
    "lng": 100.3839
  },
  {
    "name": "เพชรบูรณ์",
    "region": "ภาคกลาง",
    "lat": 16.2755,
    "lng": 101.1125
  },
  {
    "name": "กาญจนบุรี",
    "region": "ภาคตะวันตก",
    "lat": 14.2361,
    "lng": 99.4304
  },
  {
    "name": "ตาก",
    "region": "ภาคตะวันตก",
    "lat": 16.8468,
    "lng": 98.8292
  },
  {
    "name": "ประจวบคีรีขันธ์",
    "region": "ภาคตะวันตก",
    "lat": 11.8847,
    "lng": 99.6695
  },
  {
    "name": "ราชบุรี",
    "region": "ภาคตะวันตก",
    "lat": 13.6007,
    "lng": 99.7976
  },
  {
    "name": "เพชรบุรี",
    "region": "ภาคตะวันตก",
    "lat": 13.0433,
    "lng": 99.8744
  },
  {
    "name": "จันทบุรี",
    "region": "ภาคตะวันออก",
    "lat": 12.7097,
    "lng": 102.1143
  },
  {
    "name": "ฉะเชิงเทรา",
    "region": "ภาคตะวันออก",
    "lat": 13.6817,
    "lng": 101.1447
  },
  {
    "name": "ชลบุรี",
    "region": "ภาคตะวันออก",
    "lat": 13.2737,
    "lng": 101.1124
  },
  {
    "name": "ตราด",
    "region": "ภาคตะวันออก",
    "lat": 12.2482,
    "lng": 102.5212
  },
  {
    "name": "ปราจีนบุรี",
    "region": "ภาคตะวันออก",
    "lat": 14.0007,
    "lng": 101.5345
  },
  {
    "name": "ระยอง",
    "region": "ภาคตะวันออก",
    "lat": 12.805,
    "lng": 101.4179
  },
  {
    "name": "สระแก้ว",
    "region": "ภาคตะวันออก",
    "lat": 13.7259,
    "lng": 102.3391
  },
  {
    "name": "กาฬสินธุ์",
    "region": "ภาคตะวันออกเฉียงเหนือ",
    "lat": 16.5936,
    "lng": 103.613
  },
  {
    "name": "ขอนแก่น",
    "region": "ภาคตะวันออกเฉียงเหนือ",
    "lat": 16.3572,
    "lng": 102.5957
  },
  {
    "name": "ชัยภูมิ",
    "region": "ภาคตะวันออกเฉียงเหนือ",
    "lat": 15.9755,
    "lng": 101.9371
  },
  {
    "name": "นครพนม",
    "region": "ภาคตะวันออกเฉียงเหนือ",
    "lat": 17.312,
    "lng": 104.4824
  },
  {
    "name": "นครราชสีมา",
    "region": "ภาคตะวันออกเฉียงเหนือ",
    "lat": 15.0837,
    "lng": 102.1977
  },
  {
    "name": "บึงกาฬ",
    "region": "ภาคตะวันออกเฉียงเหนือ",
    "lat": 18.1119,
    "lng": 103.7031
  },
  {
    "name": "บุรีรัมย์",
    "region": "ภาคตะวันออกเฉียงเหนือ",
    "lat": 14.8936,
    "lng": 102.9741
  },
  {
    "name": "มหาสารคาม",
    "region": "ภาคตะวันออกเฉียงเหนือ",
    "lat": 15.9932,
    "lng": 103.1854
  },
  {
    "name": "มุกดาหาร",
    "region": "ภาคตะวันออกเฉียงเหนือ",
    "lat": 16.5183,
    "lng": 104.5466
  },
  {
    "name": "ยโสธร",
    "region": "ภาคตะวันออกเฉียงเหนือ",
    "lat": 15.838,
    "lng": 104.3049
  },
  {
    "name": "ร้อยเอ็ด",
    "region": "ภาคตะวันออกเฉียงเหนือ",
    "lat": 15.9378,
    "lng": 103.8012
  },
  {
    "name": "ศรีสะเกษ",
    "region": "ภาคตะวันออกเฉียงเหนือ",
    "lat": 14.9391,
    "lng": 104.3283
  },
  {
    "name": "สกลนคร",
    "region": "ภาคตะวันออกเฉียงเหนือ",
    "lat": 17.398,
    "lng": 103.83
  },
  {
    "name": "สุรินทร์",
    "region": "ภาคตะวันออกเฉียงเหนือ",
    "lat": 14.9362,
    "lng": 103.6714
  },
  {
    "name": "หนองคาย",
    "region": "ภาคตะวันออกเฉียงเหนือ",
    "lat": 17.9186,
    "lng": 102.7965
  },
  {
    "name": "หนองบัวลำภู",
    "region": "ภาคตะวันออกเฉียงเหนือ",
    "lat": 17.179,
    "lng": 102.3119
  },
  {
    "name": "อำนาจเจริญ",
    "region": "ภาคตะวันออกเฉียงเหนือ",
    "lat": 15.8581,
    "lng": 104.7069
  },
  {
    "name": "อุดรธานี",
    "region": "ภาคตะวันออกเฉียงเหนือ",
    "lat": 17.408,
    "lng": 102.8878
  },
  {
    "name": "อุบลราชธานี",
    "region": "ภาคตะวันออกเฉียงเหนือ",
    "lat": 15.2757,
    "lng": 105.0207
  },
  {
    "name": "เลย",
    "region": "ภาคตะวันออกเฉียงเหนือ",
    "lat": 17.4115,
    "lng": 101.6448
  },
  {
    "name": "น่าน",
    "region": "ภาคเหนือ",
    "lat": 18.8764,
    "lng": 100.8115
  },
  {
    "name": "พะเยา",
    "region": "ภาคเหนือ",
    "lat": 19.2837,
    "lng": 100.0922
  },
  {
    "name": "ลำปาง",
    "region": "ภาคเหนือ",
    "lat": 18.3415,
    "lng": 99.4986
  },
  {
    "name": "ลำพูน",
    "region": "ภาคเหนือ",
    "lat": 18.3465,
    "lng": 98.9588
  },
  {
    "name": "อุตรดิตถ์",
    "region": "ภาคเหนือ",
    "lat": 17.64,
    "lng": 100.3213
  },
  {
    "name": "เชียงราย",
    "region": "ภาคเหนือ",
    "lat": 19.8809,
    "lng": 99.9196
  },
  {
    "name": "เชียงใหม่",
    "region": "ภาคเหนือ",
    "lat": 18.8567,
    "lng": 98.9172
  },
  {
    "name": "แพร่",
    "region": "ภาคเหนือ",
    "lat": 18.1608,
    "lng": 100.0981
  },
  {
    "name": "แม่ฮ่องสอน",
    "region": "ภาคเหนือ",
    "lat": 18.754,
    "lng": 98.0533
  },
  {
    "name": "กระบี่",
    "region": "ภาคใต้",
    "lat": 8.103,
    "lng": 98.9959
  },
  {
    "name": "ชุมพร",
    "region": "ภาคใต้",
    "lat": 10.3085,
    "lng": 99.1125
  },
  {
    "name": "ตรัง",
    "region": "ภาคใต้",
    "lat": 7.5508,
    "lng": 99.594
  },
  {
    "name": "นครศรีธรรมราช",
    "region": "ภาคใต้",
    "lat": 8.3453,
    "lng": 99.8598
  },
  {
    "name": "นราธิวาส",
    "region": "ภาคใต้",
    "lat": 6.2311,
    "lng": 101.752
  },
  {
    "name": "ปัตตานี",
    "region": "ภาคใต้",
    "lat": 6.7567,
    "lng": 101.3549
  },
  {
    "name": "พังงา",
    "region": "ภาคใต้",
    "lat": 8.5703,
    "lng": 98.4352
  },
  {
    "name": "พัทลุง",
    "region": "ภาคใต้",
    "lat": 7.5414,
    "lng": 100.062
  },
  {
    "name": "ภูเก็ต",
    "region": "ภาคใต้",
    "lat": 7.9427,
    "lng": 98.3555
  },
  {
    "name": "ยะลา",
    "region": "ภาคใต้",
    "lat": 6.3806,
    "lng": 101.2651
  },
  {
    "name": "ระนอง",
    "region": "ภาคใต้",
    "lat": 9.9878,
    "lng": 98.6827
  },
  {
    "name": "สงขลา",
    "region": "ภาคใต้",
    "lat": 7.0711,
    "lng": 100.5368
  },
  {
    "name": "สตูล",
    "region": "ภาคใต้",
    "lat": 6.8163,
    "lng": 99.9357
  },
  {
    "name": "สุราษฎร์ธานี",
    "region": "ภาคใต้",
    "lat": 9.056,
    "lng": 99.2487
  }
];

const THAI_PROVINCES_DISTRICTS = {
  "กรุงเทพมหานคร": [
    "คลองสาน",
    "คลองสามวา",
    "คลองเตย",
    "คันนายาว",
    "จตุจักร",
    "จอมทอง",
    "ดอนเมือง",
    "ดินแดง",
    "ดุสิต",
    "ตลิ่งชัน",
    "ทวีวัฒนา",
    "ทุ่งครุ",
    "ธนบุรี",
    "บางกอกน้อย",
    "บางกอกใหญ่",
    "บางกะปิ",
    "บางขุนเทียน",
    "บางคอแหลม",
    "บางซื่อ",
    "บางนา",
    "บางบอน",
    "บางพลัด",
    "บางรัก",
    "บางเขน",
    "บางแค",
    "บึงกุ่ม",
    "ปทุมวัน",
    "ประเวศ",
    "ป้อมปราบศัตรูพ่าย",
    "พญาไท",
    "พระนคร",
    "พระโขนง",
    "ภาษีเจริญ",
    "มีนบุรี",
    "ยานนาวา",
    "ราชเทวี",
    "ราษฎร์บูรณะ",
    "ลาดกระบัง",
    "ลาดพร้าว",
    "วังทองหลาง",
    "วัฒนา",
    "สวนหลวง",
    "สะพานสูง",
    "สัมพันธวงศ์",
    "สาทร",
    "สายไหม",
    "หนองจอก",
    "หนองแขม",
    "หลักสี่",
    "ห้วยขวาง"
  ],
  "สมุทรปราการ": [
    "บางบ่อ",
    "บางพลี",
    "บางเสาธง",
    "พระประแดง",
    "พระสมุทรเจดีย์",
    "เมืองสมุทรปราการ"
  ],
  "นนทบุรี": [
    "บางกรวย",
    "บางบัวทอง",
    "บางใหญ่",
    "ปากเกร็ด",
    "เมืองนนทบุรี",
    "ไทรน้อย"
  ],
  "ปทุมธานี": [
    "คลองหลวง",
    "ธัญบุรี",
    "ลาดหลุมแก้ว",
    "ลำลูกกา",
    "สามโคก",
    "หนองเสือ",
    "เมืองปทุมธานี"
  ],
  "พระนครศรีอยุธยา": [
    "ท่าเรือ",
    "นครหลวง",
    "บางซ้าย",
    "บางบาล",
    "บางปะหัน",
    "บางปะอิน",
    "บางไทร",
    "บ้านแพรก",
    "ผักไห่",
    "พระนครศรีอยุธยา",
    "ภาชี",
    "มหาราช",
    "ลาดบัวหลวง",
    "วังน้อย",
    "อุทัย",
    "เสนา"
  ],
  "อ่างทอง": [
    "ป่าโมก",
    "วิเศษชัยชาญ",
    "สามโก้",
    "เมืองอ่างทอง",
    "แสวงหา",
    "โพธิ์ทอง",
    "ไชโย"
  ],
  "ลพบุรี": [
    "ชัยบาดาล",
    "ท่าวุ้ง",
    "ท่าหลวง",
    "บ้านหมี่",
    "พัฒนานิคม",
    "ลำสนธิ",
    "สระโบสถ์",
    "หนองม่วง",
    "เมืองลพบุรี",
    "โคกสำโรง",
    "โคกเจริญ"
  ],
  "สิงห์บุรี": [
    "ค่ายบางระจัน",
    "ท่าช้าง",
    "บางระจัน",
    "พรหมบุรี",
    "อินทร์บุรี",
    "เมืองสิงห์บุรี"
  ],
  "ชัยนาท": [
    "มโนรมย์",
    "วัดสิงห์",
    "สรรคบุรี",
    "สรรพยา",
    "หนองมะโมง",
    "หันคา",
    "เนินขาม",
    "เมืองชัยนาท"
  ],
  "สระบุรี": [
    "ดอนพุด",
    "บ้านหมอ",
    "พระพุทธบาท",
    "มวกเหล็ก",
    "วังม่วง",
    "วิหารแดง",
    "หนองแค",
    "หนองแซง",
    "หนองโดน",
    "เฉลิมพระเกียรติ",
    "เมืองสระบุรี",
    "เสาไห้",
    "แก่งคอย"
  ],
  "ชลบุรี": [
    "บางละมุง",
    "บ่อทอง",
    "บ้านบึง",
    "พนัสนิคม",
    "พานทอง",
    "ศรีราชา",
    "สัตหีบ",
    "หนองใหญ่",
    "เกาะจันทร์",
    "เกาะสีชัง",
    "เมืองชลบุรี"
  ],
  "ระยอง": [
    "นิคมพัฒนา",
    "บ้านค่าย",
    "บ้านฉาง",
    "ปลวกแดง",
    "วังจันทร์",
    "เขาชะเมา",
    "เมืองระยอง",
    "แกลง"
  ],
  "จันทบุรี": [
    "ขลุง",
    "ท่าใหม่",
    "นายายอาม",
    "มะขาม",
    "สอยดาว",
    "เขาคิชฌกูฏ",
    "เมืองจันทบุรี",
    "แก่งหางแมว",
    "แหลมสิงห์",
    "โป่งน้ำร้อน"
  ],
  "ตราด": [
    "คลองใหญ่",
    "บ่อไร่",
    "เกาะกูด",
    "เกาะช้าง",
    "เขาสมิง",
    "เมืองตราด",
    "แหลมงอบ"
  ],
  "ฉะเชิงเทรา": [
    "คลองเขื่อน",
    "ท่าตะเกียบ",
    "บางคล้า",
    "บางน้ำเปรี้ยว",
    "บางปะกง",
    "บ้านโพธิ์",
    "พนมสารคาม",
    "ราชสาส์น",
    "สนามชัยเขต",
    "เมืองฉะเชิงเทรา",
    "แปลงยาว"
  ],
  "ปราจีนบุรี": [
    "กบินทร์บุรี",
    "นาดี",
    "บ้านสร้าง",
    "ประจันตคาม",
    "ศรีมหาโพธิ",
    "ศรีมโหสถ",
    "เมืองปราจีนบุรี"
  ],
  "นครนายก": [
    "บ้านนา",
    "ปากพลี",
    "องครักษ์",
    "เมืองนครนายก"
  ],
  "สระแก้ว": [
    "คลองหาด",
    "ตาพระยา",
    "วังน้ำเย็น",
    "วังสมบูรณ์",
    "วัฒนานคร",
    "อรัญประเทศ",
    "เขาฉกรรจ์",
    "เมืองสระแก้ว",
    "โคกสูง"
  ],
  "นครราชสีมา": [
    "ขามทะเลสอ",
    "ขามสะแกแสง",
    "คง",
    "ครบุรี",
    "จักราช",
    "ชุมพวง",
    "ด่านขุนทด",
    "บัวลาย",
    "บัวใหญ่",
    "บ้านเหลื่อม",
    "ประทาย",
    "ปักธงชัย",
    "ปากช่อง",
    "พระทองคำ",
    "พิมาย",
    "ลำทะเมนชัย",
    "วังน้ำเขียว",
    "สีคิ้ว",
    "สีดา",
    "สูงเนิน",
    "หนองบุญมาก",
    "ห้วยแถลง",
    "เฉลิมพระเกียรติ",
    "เทพารักษ์",
    "เมืองนครราชสีมา",
    "เมืองยาง",
    "เสิงสาง",
    "แก้งสนามนาง",
    "โชคชัย",
    "โนนสูง",
    "โนนแดง",
    "โนนไทย"
  ],
  "บุรีรัมย์": [
    "กระสัง",
    "คูเมือง",
    "ชำนิ",
    "นางรอง",
    "นาโพธิ์",
    "บ้านกรวด",
    "บ้านด่าน",
    "บ้านใหม่ไชยพจน์",
    "ประโคนชัย",
    "ปะคำ",
    "พลับพลาชัย",
    "พุทไธสง",
    "ละหานทราย",
    "ลำปลายมาศ",
    "สตึก",
    "หนองกี่",
    "หนองหงส์",
    "ห้วยราช",
    "เฉลิมพระเกียรติ",
    "เมืองบุรีรัมย์",
    "แคนดง",
    "โนนดินแดง",
    "โนนสุวรรณ"
  ],
  "สุรินทร์": [
    "กาบเชิง",
    "จอมพระ",
    "ชุมพลบุรี",
    "ท่าตูม",
    "บัวเชด",
    "ปราสาท",
    "พนมดงรัก",
    "รัตนบุรี",
    "ลำดวน",
    "ศรีณรงค์",
    "ศีขรภูมิ",
    "สนม",
    "สังขะ",
    "สำโรงทาบ",
    "เขวาสินรินทร์",
    "เมืองสุรินทร์",
    "โนนนารายณ์"
  ],
  "ศรีสะเกษ": [
    "กันทรลักษ์",
    "กันทรารมย์",
    "ขุขันธ์",
    "ขุนหาญ",
    "น้ำเกลี้ยง",
    "บึงบูรพ์",
    "ปรางค์กู่",
    "พยุห์",
    "ภูสิงห์",
    "ยางชุมน้อย",
    "ราษีไศล",
    "วังหิน",
    "ศรีรัตนะ",
    "ศิลาลาด",
    "ห้วยทับทัน",
    "อุทุมพรพิสัย",
    "เบญจลักษ์",
    "เมืองจันทร์",
    "เมืองศรีสะเกษ",
    "โนนคูณ",
    "โพธิ์ศรีสุวรรณ",
    "ไพรบึง"
  ],
  "อุบลราชธานี": [
    "กุดข้าวปุ้น",
    "ดอนมดแดง",
    "ตระการพืชผล",
    "ตาลสุม",
    "ทุ่งศรีอุดม",
    "นาจะหลวย",
    "นาตาล",
    "นาเยีย",
    "น้ำขุ่น",
    "น้ำยืน",
    "บุณฑริก",
    "พิบูลมังสาหาร",
    "ม่วงสามสิบ",
    "วารินชำราบ",
    "ศรีเมืองใหม่",
    "สว่างวีระวงศ์",
    "สำโรง",
    "สิรินธร",
    "เขมราฐ",
    "เขื่องใน",
    "เดชอุดม",
    "เมืองอุบลราชธานี",
    "เหล่าเสือโก้ก",
    "โขงเจียม",
    "โพธิ์ไทร"
  ],
  "ยโสธร": [
    "กุดชุม",
    "คำเขื่อนแก้ว",
    "ค้อวัง",
    "ทรายมูล",
    "ป่าติ้ว",
    "มหาชนะชัย",
    "เมืองยโสธร",
    "เลิงนกทา",
    "ไทยเจริญ"
  ],
  "ชัยภูมิ": [
    "คอนสวรรค์",
    "คอนสาร",
    "จัตุรัส",
    "ซับใหญ่",
    "บำเหน็จณรงค์",
    "บ้านเขว้า",
    "บ้านแท่น",
    "ภักดีชุมพล",
    "ภูเขียว",
    "หนองบัวระเหว",
    "หนองบัวแดง",
    "เกษตรสมบูรณ์",
    "เทพสถิต",
    "เนินสง่า",
    "เมืองชัยภูมิ",
    "แก้งคร้อ"
  ],
  "อำนาจเจริญ": [
    "ชานุมาน",
    "ปทุมราชวงศา",
    "พนา",
    "ลืออำนาจ",
    "หัวตะพาน",
    "เมืองอำนาจเจริญ",
    "เสนางคนิคม"
  ],
  "บึงกาฬ": [
    "บึงโขงหลง",
    "บุ่งคล้า",
    "ปากคาด",
    "พรเจริญ",
    "ศรีวิไล",
    "เซกา",
    "โซ่พิสัย"
  ],
  "หนองบัวลำภู": [
    "นากลาง",
    "นาวัง",
    "ศรีบุญเรือง",
    "สุวรรณคูหา",
    "เมืองหนองบัวลำภู",
    "โนนสัง"
  ],
  "ขอนแก่น": [
    "กระนวน",
    "ชนบท",
    "ชุมแพ",
    "ซำสูง",
    "น้ำพอง",
    "บ้านฝาง",
    "บ้านแฮด",
    "บ้านไผ่",
    "พระยืน",
    "พล",
    "ภูผาม่าน",
    "ภูเวียง",
    "มัญจาคีรี",
    "สีชมพู",
    "หนองนาคำ",
    "หนองสองห้อง",
    "หนองเรือ",
    "อุบลรัตน์",
    "เขาสวนกวาง",
    "เปือยน้อย",
    "เมืองขอนแก่น",
    "เวียงเก่า",
    "แวงน้อย",
    "แวงใหญ่",
    "โคกโพธิ์ไชย",
    "โนนศิลา"
  ],
  "อุดรธานี": [
    "กุดจับ",
    "กุมภวาปี",
    "กู่แก้ว",
    "ทุ่งฝน",
    "นายูง",
    "น้ำโสม",
    "บ้านดุง",
    "บ้านผือ",
    "ประจักษ์ศิลปาคม",
    "พิบูลย์รักษ์",
    "วังสามหมอ",
    "ศรีธาตุ",
    "สร้างคอม",
    "หนองวัวซอ",
    "หนองหาน",
    "หนองแสง",
    "เพ็ญ",
    "เมืองอุดรธานี",
    "โนนสะอาด",
    "ไชยวาน"
  ],
  "เลย": [
    "ด่านซ้าย",
    "ท่าลี่",
    "นาด้วง",
    "นาแห้ว",
    "ปากชม",
    "ผาขาว",
    "ภูกระดึง",
    "ภูหลวง",
    "ภูเรือ",
    "วังสะพุง",
    "หนองหิน",
    "เชียงคาน",
    "เมืองเลย",
    "เอราวัณ"
  ],
  "หนองคาย": [
    "ท่าบ่อ",
    "รัตนวาปี",
    "ศรีเชียงใหม่",
    "สระใคร",
    "สังคม",
    "เฝ้าไร่",
    "เมืองหนองคาย",
    "โพธิ์ตาก",
    "โพนพิสัย"
  ],
  "มหาสารคาม": [
    "กันทรวิชัย",
    "กุดรัง",
    "ชื่นชม",
    "นาดูน",
    "นาเชือก",
    "บรบือ",
    "พยัคฆภูมิพิสัย",
    "ยางสีสุราช",
    "วาปีปทุม",
    "เชียงยืน",
    "เมืองมหาสารคาม",
    "แกดำ",
    "โกสุมพิสัย"
  ],
  "ร้อยเอ็ด": [
    "จตุรพักตรพิมาน",
    "จังหาร",
    "ทุ่งเขาหลวง",
    "ธวัชบุรี",
    "ปทุมรัตต์",
    "พนมไพร",
    "ศรีสมเด็จ",
    "สุวรรณภูมิ",
    "หนองพอก",
    "หนองฮี",
    "อาจสามารถ",
    "เกษตรวิสัย",
    "เชียงขวัญ",
    "เมยวดี",
    "เมืองร้อยเอ็ด",
    "เมืองสรวง",
    "เสลภูมิ",
    "โพธิ์ชัย",
    "โพนทราย",
    "โพนทอง"
  ],
  "กาฬสินธุ์": [
    "กมลาไสย",
    "กุฉินารายณ์",
    "คำม่วง",
    "ฆ้องชัย",
    "ดอนจาน",
    "ท่าคันโท",
    "นาคู",
    "นามน",
    "ยางตลาด",
    "ร่องคำ",
    "สมเด็จ",
    "สหัสขันธ์",
    "สามชัย",
    "หนองกุงศรี",
    "ห้วยผึ้ง",
    "ห้วยเม็ก",
    "เขาวง",
    "เมืองกาฬสินธุ์"
  ],
  "สกลนคร": [
    "กุดบาก",
    "กุสุมาลย์",
    "คำตากล้า",
    "นิคมน้ำอูน",
    "บ้านม่วง",
    "พรรณานิคม",
    "พังโคน",
    "ภูพาน",
    "วานรนิวาส",
    "วาริชภูมิ",
    "สว่างแดนดิน",
    "ส่องดาว",
    "อากาศอำนวย",
    "เจริญศิลป์",
    "เต่างอย",
    "เมืองสกลนคร",
    "โคกศรีสุพรรณ",
    "โพนนาแก้ว"
  ],
  "นครพนม": [
    "ท่าอุเทน",
    "ธาตุพนม",
    "นาทม",
    "นาหว้า",
    "นาแก",
    "บ้านแพง",
    "ปลาปาก",
    "วังยาง",
    "ศรีสงคราม",
    "เมืองนครพนม",
    "เรณูนคร",
    "โพนสวรรค์"
  ],
  "มุกดาหาร": [
    "คำชะอี",
    "ดงหลวง",
    "ดอนตาล",
    "นิคมคำสร้อย",
    "หนองสูง",
    "เมืองมุกดาหาร"
  ],
  "เชียงใหม่": [
    "กัลยาณิวัฒนา",
    "จอมทอง",
    "ดอยสะเก็ด",
    "ดอยหล่อ",
    "ดอยเต่า",
    "ฝาง",
    "พร้าว",
    "สะเมิง",
    "สันกำแพง",
    "สันทราย",
    "สันป่าตอง",
    "สารภี",
    "หางดง",
    "อมก๋อย",
    "ฮอด",
    "เชียงดาว",
    "เมืองเชียงใหม่",
    "เวียงแหง",
    "แม่ริม",
    "แม่วาง",
    "แม่ออน",
    "แม่อาย",
    "แม่แจ่ม",
    "แม่แตง",
    "ไชยปราการ"
  ],
  "ลำพูน": [
    "ทุ่งหัวช้าง",
    "บ้านธิ",
    "บ้านโฮ่ง",
    "ป่าซาง",
    "ลี้",
    "เมืองลำพูน",
    "เวียงหนองล่อง",
    "แม่ทา"
  ],
  "ลำปาง": [
    "งาว",
    "วังเหนือ",
    "สบปราบ",
    "ห้างฉัตร",
    "เกาะคา",
    "เถิน",
    "เมืองปาน",
    "เมืองลำปาง",
    "เสริมงาม",
    "แจ้ห่ม",
    "แม่ทะ",
    "แม่พริก",
    "แม่เมาะ"
  ],
  "อุตรดิตถ์": [
    "ตรอน",
    "ทองแสนขัน",
    "ท่าปลา",
    "น้ำปาด",
    "บ้านโคก",
    "พิชัย",
    "ฟากท่า",
    "ลับแล",
    "เมืองอุตรดิตถ์"
  ],
  "แพร่": [
    "ร้องกวาง",
    "ลอง",
    "วังชิ้น",
    "สอง",
    "สูงเม่น",
    "หนองม่วงไข่",
    "เด่นชัย",
    "เมืองแพร่"
  ],
  "น่าน": [
    "ทุ่งช้าง",
    "ท่าวังผา",
    "นาน้อย",
    "นาหมื่น",
    "บ่อเกลือ",
    "บ้านหลวง",
    "ปัว",
    "ภูเพียง",
    "สองแคว",
    "สันติสุข",
    "เฉลิมพระเกียรติ",
    "เชียงกลาง",
    "เมืองน่าน",
    "เวียงสา",
    "แม่จริม"
  ],
  "พะเยา": [
    "จุน",
    "ดอกคำใต้",
    "ปง",
    "ภูกามยาว",
    "ภูซาง",
    "เชียงคำ",
    "เชียงม่วน",
    "เมืองพะเยา",
    "แม่ใจ"
  ],
  "เชียงราย": [
    "ขุนตาล",
    "ดอยหลวง",
    "ป่าแดด",
    "พญาเม็งราย",
    "พาน",
    "เชียงของ",
    "เชียงแสน",
    "เทิง",
    "เมืองเชียงราย",
    "เวียงชัย",
    "เวียงป่าเป้า",
    "เวียงเชียงรุ้ง",
    "เวียงแก่น",
    "แม่จัน",
    "แม่ฟ้าหลวง",
    "แม่ลาว",
    "แม่สรวย",
    "แม่สาย"
  ],
  "แม่ฮ่องสอน": [
    "ขุนยวม",
    "ปางมะผ้า",
    "ปาย",
    "สบเมย",
    "เมืองแม่ฮ่องสอน",
    "แม่ลาน้อย",
    "แม่สะเรียง"
  ],
  "นครสวรรค์": [
    "ชุมตาบง",
    "ชุมแสง",
    "ตากฟ้า",
    "ตาคลี",
    "ท่าตะโก",
    "บรรพตพิสัย",
    "พยุหะคีรี",
    "ลาดยาว",
    "หนองบัว",
    "เก้าเลี้ยว",
    "เมืองนครสวรรค์",
    "แม่วงก์",
    "แม่เปิน",
    "โกรกพระ",
    "ไพศาลี"
  ],
  "อุทัยธานี": [
    "ทัพทัน",
    "บ้านไร่",
    "ลานสัก",
    "สว่างอารมณ์",
    "หนองขาหย่าง",
    "หนองฉาง",
    "ห้วยคต",
    "เมืองอุทัยธานี"
  ],
  "กำแพงเพชร": [
    "ขาณุวรลักษบุรี",
    "คลองขลุง",
    "คลองลาน",
    "ทรายทองวัฒนา",
    "บึงสามัคคี",
    "ปางศิลาทอง",
    "พรานกระต่าย",
    "ลานกระบือ",
    "เมืองกำแพงเพชร",
    "โกสัมพีนคร",
    "ไทรงาม"
  ],
  "ตาก": [
    "ท่าสองยาง",
    "บ้านตาก",
    "พบพระ",
    "วังเจ้า",
    "สามเงา",
    "อุ้มผาง",
    "เมืองตาก",
    "แม่ระมาด",
    "แม่สอด"
  ],
  "สุโขทัย": [
    "กงไกรลาศ",
    "คีรีมาศ",
    "ทุ่งเสลี่ยม",
    "บ้านด่านลานหอย",
    "ศรีนคร",
    "ศรีสัชนาลัย",
    "ศรีสำโรง",
    "สวรรคโลก",
    "เมืองสุโขทัย"
  ],
  "พิษณุโลก": [
    "ชาติตระการ",
    "นครไทย",
    "บางกระทุ่ม",
    "บางระกำ",
    "พรหมพิราม",
    "วังทอง",
    "วัดโบสถ์",
    "เนินมะปราง",
    "เมืองพิษณุโลก"
  ],
  "พิจิตร": [
    "ดงเจริญ",
    "ตะพานหิน",
    "ทับคล้อ",
    "บางมูลนาก",
    "บึงนาราง",
    "วชิรบารมี",
    "วังทรายพูน",
    "สากเหล็ก",
    "สามง่าม",
    "เมืองพิจิตร",
    "โพทะเล",
    "โพธิ์ประทับช้าง"
  ],
  "เพชรบูรณ์": [
    "ชนแดน",
    "น้ำหนาว",
    "บึงสามพัน",
    "วังโป่ง",
    "วิเชียรบุรี",
    "ศรีเทพ",
    "หนองไผ่",
    "หล่มสัก",
    "หล่มเก่า",
    "เขาค้อ",
    "เมืองเพชรบูรณ์"
  ],
  "ราชบุรี": [
    "จอมบึง",
    "ดำเนินสะดวก",
    "บางแพ",
    "บ้านคา",
    "บ้านโป่ง",
    "ปากท่อ",
    "วัดเพลง",
    "สวนผึ้ง",
    "เมืองราชบุรี",
    "โพธาราม"
  ],
  "กาญจนบุรี": [
    "ด่านมะขามเตี้ย",
    "ทองผาภูมิ",
    "ท่ามะกา",
    "ท่าม่วง",
    "บ่อพลอย",
    "พนมทวน",
    "ศรีสวัสดิ์",
    "สังขละบุรี",
    "หนองปรือ",
    "ห้วยกระเจา",
    "เมืองกาญจนบุรี",
    "เลาขวัญ",
    "ไทรโยค"
  ],
  "สุพรรณบุรี": [
    "ดอนเจดีย์",
    "ด่านช้าง",
    "บางปลาม้า",
    "ศรีประจันต์",
    "สองพี่น้อง",
    "สามชุก",
    "หนองหญ้าไซ",
    "อู่ทอง",
    "เดิมบางนางบวช",
    "เมืองสุพรรณบุรี"
  ],
  "นครปฐม": [
    "กำแพงแสน",
    "ดอนตูม",
    "นครชัยศรี",
    "บางเลน",
    "พุทธมณฑล",
    "สามพราน",
    "เมืองนครปฐม"
  ],
  "สมุทรสาคร": [
    "กระทุ่มแบน",
    "บ้านแพ้ว",
    "เมืองสมุทรสาคร"
  ],
  "สมุทรสงคราม": [
    "บางคนที",
    "อัมพวา",
    "เมืองสมุทรสงคราม"
  ],
  "เพชรบุรี": [
    "ชะอำ",
    "ท่ายาง",
    "บ้านลาด",
    "บ้านแหลม",
    "หนองหญ้าปล้อง",
    "เขาย้อย",
    "เมืองเพชรบุรี",
    "แก่งกระจาน"
  ],
  "ประจวบคีรีขันธ์": [
    "กุยบุรี",
    "ทับสะแก",
    "บางสะพาน",
    "บางสะพานน้อย",
    "ปราณบุรี",
    "สามร้อยยอด",
    "หัวหิน",
    "เมืองประจวบคีรีขันธ์"
  ],
  "นครศรีธรรมราช": [
    "ขนอม",
    "จุฬาภรณ์",
    "ฉวาง",
    "ชะอวด",
    "ช้างกลาง",
    "ถ้ำพรรณรา",
    "ทุ่งสง",
    "ทุ่งใหญ่",
    "ท่าศาลา",
    "นบพิตำ",
    "นาบอน",
    "บางขัน",
    "ปากพนัง",
    "พรหมคีรี",
    "พระพรหม",
    "พิปูน",
    "ร่อนพิบูลย์",
    "ลานสกา",
    "สิชล",
    "หัวไทร",
    "เฉลิมพระเกียรติ",
    "เชียรใหญ่",
    "เมืองนครศรีธรรมราช"
  ],
  "กระบี่": [
    "คลองท่อม",
    "ปลายพระยา",
    "ลำทับ",
    "อ่าวลึก",
    "เกาะลันตา",
    "เขาพนม",
    "เมืองกระบี่",
    "เหนือคลอง"
  ],
  "พังงา": [
    "กะปง",
    "คุระบุรี",
    "ตะกั่วทุ่ง",
    "ตะกั่วป่า",
    "ทับปุด",
    "ท้ายเหมือง",
    "เกาะยาว",
    "เมืองพังงา"
  ],
  "ภูเก็ต": [
    "กะทู้",
    "ถลาง",
    "เมืองภูเก็ต"
  ],
  "สุราษฎร์ธานี": [
    "กาญจนดิษฐ์",
    "คีรีรัฐนิคม",
    "ชัยบุรี",
    "ดอนสัก",
    "ท่าฉาง",
    "ท่าชนะ",
    "บ้านตาขุน",
    "บ้านนาสาร",
    "บ้านนาเดิม",
    "พนม",
    "พระแสง",
    "พุนพิน",
    "วิภาวดี",
    "เกาะพะงัน",
    "เกาะสมุย",
    "เคียนซา",
    "เมืองสุราษฎร์ธานี",
    "เวียงสระ",
    "ไชยา"
  ],
  "ระนอง": [
    "กระบุรี",
    "กะเปอร์",
    "ละอุ่น",
    "สุขสำราญ",
    "เมืองระนอง"
  ],
  "ชุมพร": [
    "ทุ่งตะโก",
    "ท่าแซะ",
    "ปะทิว",
    "พะโต๊ะ",
    "ละแม",
    "สวี",
    "หลังสวน",
    "เมืองชุมพร"
  ],
  "สงขลา": [
    "กระแสสินธุ์",
    "คลองหอยโข่ง",
    "ควนเนียง",
    "จะนะ",
    "นาทวี",
    "นาหม่อม",
    "บางกล่ำ",
    "ระโนด",
    "รัตภูมิ",
    "สทิงพระ",
    "สะบ้าย้อย",
    "สะเดา",
    "สิงหนคร",
    "หาดใหญ่",
    "เทพา",
    "เมืองสงขลา"
  ],
  "สตูล": [
    "ควนกาหลง",
    "ควนโดน",
    "ทุ่งหว้า",
    "ท่าแพ",
    "มะนัง",
    "ละงู",
    "เมืองสตูล"
  ],
  "ตรัง": [
    "กันตัง",
    "นาโยง",
    "ปะเหลียน",
    "ย่านตาขาว",
    "รัษฎา",
    "วังวิเศษ",
    "สิเกา",
    "หาดสำราญ",
    "ห้วยยอด",
    "เมืองตรัง"
  ],
  "พัทลุง": [
    "กงหรา",
    "ควนขนุน",
    "ตะโหมด",
    "บางแก้ว",
    "ปากพะยูน",
    "ป่าบอน",
    "ป่าพะยอม",
    "ศรีนครินทร์",
    "ศรีบรรพต",
    "เขาชัยสน",
    "เมืองพัทลุง"
  ],
  "ปัตตานี": [
    "กะพ้อ",
    "ทุ่งยางแดง",
    "ปะนาเระ",
    "มายอ",
    "ยะรัง",
    "ยะหริ่ง",
    "สายบุรี",
    "หนองจิก",
    "เมืองปัตตานี",
    "แม่ลาน",
    "โคกโพธิ์",
    "ไม้แก่น"
  ],
  "ยะลา": [
    "กาบัง",
    "ธารโต",
    "บันนังสตา",
    "ยะหา",
    "รามัน",
    "เบตง",
    "เมืองยะลา"
  ],
  "นราธิวาส": [
    "จะแนะ",
    "ตากใบ",
    "บาเจาะ",
    "ยี่งอ",
    "ระแงะ",
    "รือเสาะ",
    "ศรีสาคร",
    "สุคิริน",
    "สุไหงปาดี",
    "สุไหงโกลก",
    "เจาะไอร้อง",
    "เมืองนราธิวาส",
    "แว้ง"
  ]
};

const DISTRICT_COORDS = {
  "พระนคร, กรุงเทพมหานคร": {
    "lat": 13.7564,
    "lng": 100.4993
  },
  "ดุสิต, กรุงเทพมหานคร": {
    "lat": 13.7728,
    "lng": 100.5154
  },
  "หนองจอก, กรุงเทพมหานคร": {
    "lat": 13.8513,
    "lng": 100.8561
  },
  "บางรัก, กรุงเทพมหานคร": {
    "lat": 13.728,
    "lng": 100.5232
  },
  "บางเขน, กรุงเทพมหานคร": {
    "lat": 13.867,
    "lng": 100.628
  },
  "บางกะปิ, กรุงเทพมหานคร": {
    "lat": 13.771,
    "lng": 100.6475
  },
  "ปทุมวัน, กรุงเทพมหานคร": {
    "lat": 13.7405,
    "lng": 100.5318
  },
  "ป้อมปราบศัตรูพ่าย, กรุงเทพมหานคร": {
    "lat": 13.7512,
    "lng": 100.5114
  },
  "พระโขนง, กรุงเทพมหานคร": {
    "lat": 13.692,
    "lng": 100.626
  },
  "มีนบุรี, กรุงเทพมหานคร": {
    "lat": 13.808,
    "lng": 100.7485
  },
  "ลาดกระบัง, กรุงเทพมหานคร": {
    "lat": 13.743,
    "lng": 100.7892
  },
  "ยานนาวา, กรุงเทพมหานคร": {
    "lat": 13.6895,
    "lng": 100.5385
  },
  "สัมพันธวงศ์, กรุงเทพมหานคร": {
    "lat": 13.738,
    "lng": 100.5093
  },
  "พญาไท, กรุงเทพมหานคร": {
    "lat": 13.782,
    "lng": 100.545
  },
  "ธนบุรี, กรุงเทพมหานคร": {
    "lat": 13.722,
    "lng": 100.4848
  },
  "บางกอกใหญ่, กรุงเทพมหานคร": {
    "lat": 13.738,
    "lng": 100.4805
  },
  "ห้วยขวาง, กรุงเทพมหานคร": {
    "lat": 13.7723,
    "lng": 100.5807
  },
  "คลองสาน, กรุงเทพมหานคร": {
    "lat": 13.7265,
    "lng": 100.5025
  },
  "ตลิ่งชัน, กรุงเทพมหานคร": {
    "lat": 13.7675,
    "lng": 100.4398
  },
  "บางกอกน้อย, กรุงเทพมหานคร": {
    "lat": 13.7634,
    "lng": 100.4728
  },
  "บางขุนเทียน, กรุงเทพมหานคร": {
    "lat": 13.58,
    "lng": 100.4145
  },
  "ภาษีเจริญ, กรุงเทพมหานคร": {
    "lat": 13.7267,
    "lng": 100.4456
  },
  "หนองแขม, กรุงเทพมหานคร": {
    "lat": 13.697,
    "lng": 100.3545
  },
  "ราษฎร์บูรณะ, กรุงเทพมหานคร": {
    "lat": 13.6725,
    "lng": 100.5005
  },
  "บางพลัด, กรุงเทพมหานคร": {
    "lat": 13.787,
    "lng": 100.4933
  },
  "ดินแดง, กรุงเทพมหานคร": {
    "lat": 13.778,
    "lng": 100.567
  },
  "บึงกุ่ม, กรุงเทพมหานคร": {
    "lat": 13.808,
    "lng": 100.65
  },
  "สาทร, กรุงเทพมหานคร": {
    "lat": 13.714,
    "lng": 100.529
  },
  "บางซื่อ, กรุงเทพมหานคร": {
    "lat": 13.82,
    "lng": 100.529
  },
  "จตุจักร, กรุงเทพมหานคร": {
    "lat": 13.826,
    "lng": 100.565
  },
  "บางคอแหลม, กรุงเทพมหานคร": {
    "lat": 13.6987,
    "lng": 100.506
  },
  "ประเวศ, กรุงเทพมหานคร": {
    "lat": 13.6953,
    "lng": 100.6697
  },
  "คลองเตย, กรุงเทพมหานคร": {
    "lat": 13.7133,
    "lng": 100.5787
  },
  "สวนหลวง, กรุงเทพมหานคร": {
    "lat": 13.726,
    "lng": 100.628
  },
  "จอมทอง, กรุงเทพมหานคร": {
    "lat": 13.6902,
    "lng": 100.4655
  },
  "ดอนเมือง, กรุงเทพมหานคร": {
    "lat": 13.925,
    "lng": 100.593
  },
  "ราชเทวี, กรุงเทพมหานคร": {
    "lat": 13.756,
    "lng": 100.5387
  },
  "ลาดพร้าว, กรุงเทพมหานคร": {
    "lat": 13.8255,
    "lng": 100.606
  },
  "วัฒนา, กรุงเทพมหานคร": {
    "lat": 13.7327,
    "lng": 100.5773
  },
  "บางแค, กรุงเทพมหานคร": {
    "lat": 13.7105,
    "lng": 100.3975
  },
  "หลักสี่, กรุงเทพมหานคร": {
    "lat": 13.877,
    "lng": 100.572
  },
  "สายไหม, กรุงเทพมหานคร": {
    "lat": 13.905,
    "lng": 100.652
  },
  "คันนายาว, กรุงเทพมหานคร": {
    "lat": 13.821,
    "lng": 100.677
  },
  "สะพานสูง, กรุงเทพมหานคร": {
    "lat": 13.761,
    "lng": 100.688
  },
  "วังทองหลาง, กรุงเทพมหานคร": {
    "lat": 13.779,
    "lng": 100.609
  },
  "คลองสามวา, กรุงเทพมหานคร": {
    "lat": 13.8678,
    "lng": 100.7398
  },
  "บางนา, กรุงเทพมหานคร": {
    "lat": 13.672,
    "lng": 100.616
  },
  "ทวีวัฒนา, กรุงเทพมหานคร": {
    "lat": 13.7705,
    "lng": 100.369
  },
  "ทุ่งครุ, กรุงเทพมหานคร": {
    "lat": 13.6325,
    "lng": 100.5035
  },
  "บางบอน, กรุงเทพมหานคร": {
    "lat": 13.646,
    "lng": 100.37
  },
  "เมืองสมุทรปราการ, สมุทรปราการ": {
    "lat": 13.5906,
    "lng": 100.6229
  },
  "บางบ่อ, สมุทรปราการ": {
    "lat": 13.6044,
    "lng": 100.8809
  },
  "บางพลี, สมุทรปราการ": {
    "lat": 13.6338,
    "lng": 100.7222
  },
  "พระประแดง, สมุทรปราการ": {
    "lat": 13.6599,
    "lng": 100.5546
  },
  "พระสมุทรเจดีย์, สมุทรปราการ": {
    "lat": 13.5668,
    "lng": 100.5274
  },
  "บางเสาธง, สมุทรปราการ": {
    "lat": 13.6433,
    "lng": 100.8057
  },
  "เมืองนนทบุรี, นนทบุรี": {
    "lat": 13.8508,
    "lng": 100.4852
  },
  "บางกรวย, นนทบุรี": {
    "lat": 13.8126,
    "lng": 100.4402
  },
  "บางใหญ่, นนทบุรี": {
    "lat": 13.8555,
    "lng": 100.3888
  },
  "บางบัวทอง, นนทบุรี": {
    "lat": 13.9256,
    "lng": 100.3992
  },
  "ไทรน้อย, นนทบุรี": {
    "lat": 14.0009,
    "lng": 100.3131
  },
  "ปากเกร็ด, นนทบุรี": {
    "lat": 13.9191,
    "lng": 100.4936
  },
  "เมืองปทุมธานี, ปทุมธานี": {
    "lat": 13.9964,
    "lng": 100.5409
  },
  "คลองหลวง, ปทุมธานี": {
    "lat": 14.0967,
    "lng": 100.6847
  },
  "ธัญบุรี, ปทุมธานี": {
    "lat": 14.0272,
    "lng": 100.7555
  },
  "หนองเสือ, ปทุมธานี": {
    "lat": 14.1669,
    "lng": 100.8399
  },
  "ลาดหลุมแก้ว, ปทุมธานี": {
    "lat": 14.0437,
    "lng": 100.4144
  },
  "ลำลูกกา, ปทุมธานี": {
    "lat": 13.9759,
    "lng": 100.7837
  },
  "สามโคก, ปทุมธานี": {
    "lat": 14.0743,
    "lng": 100.53
  },
  "พระนครศรีอยุธยา, พระนครศรีอยุธยา": {
    "lat": 14.3576,
    "lng": 100.562
  },
  "ท่าเรือ, พระนครศรีอยุธยา": {
    "lat": 14.5382,
    "lng": 100.7109
  },
  "นครหลวง, พระนครศรีอยุธยา": {
    "lat": 14.4631,
    "lng": 100.6285
  },
  "บางไทร, พระนครศรีอยุธยา": {
    "lat": 14.2227,
    "lng": 100.4835
  },
  "บางบาล, พระนครศรีอยุธยา": {
    "lat": 14.3863,
    "lng": 100.4632
  },
  "บางปะอิน, พระนครศรีอยุธยา": {
    "lat": 14.2499,
    "lng": 100.5907
  },
  "บางปะหัน, พระนครศรีอยุธยา": {
    "lat": 14.4729,
    "lng": 100.5438
  },
  "ผักไห่, พระนครศรีอยุธยา": {
    "lat": 14.4563,
    "lng": 100.358
  },
  "ภาชี, พระนครศรีอยุธยา": {
    "lat": 14.4411,
    "lng": 100.7241
  },
  "ลาดบัวหลวง, พระนครศรีอยุธยา": {
    "lat": 14.1663,
    "lng": 100.3497
  },
  "วังน้อย, พระนครศรีอยุธยา": {
    "lat": 14.242,
    "lng": 100.7253
  },
  "เสนา, พระนครศรีอยุธยา": {
    "lat": 14.3117,
    "lng": 100.3805
  },
  "บางซ้าย, พระนครศรีอยุธยา": {
    "lat": 14.3095,
    "lng": 100.3
  },
  "อุทัย, พระนครศรีอยุธยา": {
    "lat": 14.355,
    "lng": 100.6899
  },
  "มหาราช, พระนครศรีอยุธยา": {
    "lat": 14.5696,
    "lng": 100.5347
  },
  "บ้านแพรก, พระนครศรีอยุธยา": {
    "lat": 14.6412,
    "lng": 100.562
  },
  "เมืองอ่างทอง, อ่างทอง": {
    "lat": 14.583,
    "lng": 100.449
  },
  "ไชโย, อ่างทอง": {
    "lat": 14.6747,
    "lng": 100.4682
  },
  "ป่าโมก, อ่างทอง": {
    "lat": 14.4902,
    "lng": 100.4533
  },
  "โพธิ์ทอง, อ่างทอง": {
    "lat": 14.6709,
    "lng": 100.3741
  },
  "แสวงหา, อ่างทอง": {
    "lat": 14.7477,
    "lng": 100.3001
  },
  "วิเศษชัยชาญ, อ่างทอง": {
    "lat": 14.5524,
    "lng": 100.3204
  },
  "สามโก้, อ่างทอง": {
    "lat": 14.5986,
    "lng": 100.261
  },
  "เมืองลพบุรี, ลพบุรี": {
    "lat": 14.7754,
    "lng": 100.6264
  },
  "พัฒนานิคม, ลพบุรี": {
    "lat": 14.9034,
    "lng": 101.0199
  },
  "โคกสำโรง, ลพบุรี": {
    "lat": 15.0658,
    "lng": 100.7409
  },
  "ชัยบาดาล, ลพบุรี": {
    "lat": 15.1862,
    "lng": 101.1334
  },
  "ท่าวุ้ง, ลพบุรี": {
    "lat": 14.828,
    "lng": 100.502
  },
  "บ้านหมี่, ลพบุรี": {
    "lat": 15.0458,
    "lng": 100.5536
  },
  "ท่าหลวง, ลพบุรี": {
    "lat": 15.047,
    "lng": 101.187
  },
  "สระโบสถ์, ลพบุรี": {
    "lat": 15.2068,
    "lng": 100.8442
  },
  "โคกเจริญ, ลพบุรี": {
    "lat": 15.4204,
    "lng": 100.8424
  },
  "ลำสนธิ, ลพบุรี": {
    "lat": 15.3042,
    "lng": 101.3497
  },
  "หนองม่วง, ลพบุรี": {
    "lat": 15.2732,
    "lng": 100.6948
  },
  "เมืองสิงห์บุรี, สิงห์บุรี": {
    "lat": 14.8995,
    "lng": 100.4023
  },
  "บางระจัน, สิงห์บุรี": {
    "lat": 14.8971,
    "lng": 100.2878
  },
  "ค่ายบางระจัน, สิงห์บุรี": {
    "lat": 14.8208,
    "lng": 100.296
  },
  "พรหมบุรี, สิงห์บุรี": {
    "lat": 14.7939,
    "lng": 100.4429
  },
  "ท่าช้าง, สิงห์บุรี": {
    "lat": 14.778,
    "lng": 100.3907
  },
  "อินทร์บุรี, สิงห์บุรี": {
    "lat": 15.0189,
    "lng": 100.3471
  },
  "เมืองชัยนาท, ชัยนาท": {
    "lat": 15.1886,
    "lng": 100.1329
  },
  "มโนรมย์, ชัยนาท": {
    "lat": 15.3213,
    "lng": 100.1497
  },
  "วัดสิงห์, ชัยนาท": {
    "lat": 15.2341,
    "lng": 99.9933
  },
  "สรรพยา, ชัยนาท": {
    "lat": 15.1396,
    "lng": 100.2516
  },
  "สรรคบุรี, ชัยนาท": {
    "lat": 15.0311,
    "lng": 100.1891
  },
  "หันคา, ชัยนาท": {
    "lat": 15.038,
    "lng": 99.9879
  },
  "หนองมะโมง, ชัยนาท": {
    "lat": 15.233,
    "lng": 99.8238
  },
  "เนินขาม, ชัยนาท": {
    "lat": 14.987,
    "lng": 99.8483
  },
  "เมืองสระบุรี, สระบุรี": {
    "lat": 14.5123,
    "lng": 100.9163
  },
  "แก่งคอย, สระบุรี": {
    "lat": 14.5903,
    "lng": 101.0294
  },
  "หนองแค, สระบุรี": {
    "lat": 14.3744,
    "lng": 100.8573
  },
  "วิหารแดง, สระบุรี": {
    "lat": 14.3475,
    "lng": 100.987
  },
  "หนองแซง, สระบุรี": {
    "lat": 14.4874,
    "lng": 100.8024
  },
  "บ้านหมอ, สระบุรี": {
    "lat": 14.6097,
    "lng": 100.7191
  },
  "ดอนพุด, สระบุรี": {
    "lat": 14.604,
    "lng": 100.618
  },
  "หนองโดน, สระบุรี": {
    "lat": 14.6995,
    "lng": 100.6912
  },
  "พระพุทธบาท, สระบุรี": {
    "lat": 14.7149,
    "lng": 100.8099
  },
  "เสาไห้, สระบุรี": {
    "lat": 14.567,
    "lng": 100.8428
  },
  "มวกเหล็ก, สระบุรี": {
    "lat": 14.7963,
    "lng": 101.2818
  },
  "วังม่วง, สระบุรี": {
    "lat": 14.808,
    "lng": 101.133
  },
  "เฉลิมพระเกียรติ, สระบุรี": {
    "lat": 14.6327,
    "lng": 100.9098
  },
  "เมืองชลบุรี, ชลบุรี": {
    "lat": 13.3488,
    "lng": 100.9878
  },
  "บ้านบึง, ชลบุรี": {
    "lat": 13.2944,
    "lng": 101.1504
  },
  "หนองใหญ่, ชลบุรี": {
    "lat": 13.1396,
    "lng": 101.3802
  },
  "บางละมุง, ชลบุรี": {
    "lat": 12.9504,
    "lng": 100.9564
  },
  "พานทอง, ชลบุรี": {
    "lat": 13.4703,
    "lng": 101.089
  },
  "พนัสนิคม, ชลบุรี": {
    "lat": 13.4684,
    "lng": 101.2039
  },
  "ศรีราชา, ชลบุรี": {
    "lat": 13.1303,
    "lng": 101.0102
  },
  "เกาะสีชัง, ชลบุรี": {
    "lat": 13.151,
    "lng": 100.809
  },
  "สัตหีบ, ชลบุรี": {
    "lat": 12.6928,
    "lng": 100.9116
  },
  "บ่อทอง, ชลบุรี": {
    "lat": 13.2742,
    "lng": 101.462
  },
  "เกาะจันทร์, ชลบุรี": {
    "lat": 13.396,
    "lng": 101.3545
  },
  "เมืองระยอง, ระยอง": {
    "lat": 12.6794,
    "lng": 101.3332
  },
  "บ้านฉาง, ระยอง": {
    "lat": 12.7413,
    "lng": 101.0557
  },
  "แกลง, ระยอง": {
    "lat": 12.7555,
    "lng": 101.6475
  },
  "วังจันทร์, ระยอง": {
    "lat": 12.9328,
    "lng": 101.5185
  },
  "บ้านค่าย, ระยอง": {
    "lat": 12.8029,
    "lng": 101.3239
  },
  "ปลวกแดง, ระยอง": {
    "lat": 12.9843,
    "lng": 101.2443
  },
  "เขาชะเมา, ระยอง": {
    "lat": 12.9807,
    "lng": 101.6733
  },
  "นิคมพัฒนา, ระยอง": {
    "lat": 12.8468,
    "lng": 101.1515
  },
  "เมืองจันทบุรี, จันทบุรี": {
    "lat": 12.5936,
    "lng": 102.1158
  },
  "ขลุง, จันทบุรี": {
    "lat": 12.5065,
    "lng": 102.2645
  },
  "ท่าใหม่, จันทบุรี": {
    "lat": 12.653,
    "lng": 101.9955
  },
  "โป่งน้ำร้อน, จันทบุรี": {
    "lat": 12.9648,
    "lng": 102.3878
  },
  "มะขาม, จันทบุรี": {
    "lat": 12.7228,
    "lng": 102.202
  },
  "แหลมสิงห์, จันทบุรี": {
    "lat": 12.469,
    "lng": 102.124
  },
  "สอยดาว, จันทบุรี": {
    "lat": 13.1854,
    "lng": 102.2484
  },
  "แก่งหางแมว, จันทบุรี": {
    "lat": 13.0228,
    "lng": 101.8692
  },
  "นายายอาม, จันทบุรี": {
    "lat": 12.7113,
    "lng": 101.873
  },
  "เขาคิชฌกูฏ, จันทบุรี": {
    "lat": 12.9317,
    "lng": 102.0855
  },
  "เมืองตราด, ตราด": {
    "lat": 12.2235,
    "lng": 102.5772
  },
  "คลองใหญ่, ตราด": {
    "lat": 11.7943,
    "lng": 102.8677
  },
  "เขาสมิง, ตราด": {
    "lat": 12.433,
    "lng": 102.4281
  },
  "บ่อไร่, ตราด": {
    "lat": 12.5754,
    "lng": 102.5478
  },
  "แหลมงอบ, ตราด": {
    "lat": 12.2155,
    "lng": 102.3795
  },
  "เกาะกูด, ตราด": {
    "lat": 11.768,
    "lng": 102.458
  },
  "เกาะช้าง, ตราด": {
    "lat": 12.0785,
    "lng": 102.289
  },
  "เมืองฉะเชิงเทรา, ฉะเชิงเทรา": {
    "lat": 13.7136,
    "lng": 101.0364
  },
  "บางคล้า, ฉะเชิงเทรา": {
    "lat": 13.725,
    "lng": 101.1969
  },
  "บางน้ำเปรี้ยว, ฉะเชิงเทรา": {
    "lat": 13.8822,
    "lng": 101.0257
  },
  "บางปะกง, ฉะเชิงเทรา": {
    "lat": 13.5402,
    "lng": 100.9652
  },
  "บ้านโพธิ์, ฉะเชิงเทรา": {
    "lat": 13.6084,
    "lng": 101.0768
  },
  "พนมสารคาม, ฉะเชิงเทรา": {
    "lat": 13.748,
    "lng": 101.376
  },
  "ราชสาส์น, ฉะเชิงเทรา": {
    "lat": 13.7797,
    "lng": 101.2823
  },
  "สนามชัยเขต, ฉะเชิงเทรา": {
    "lat": 13.6212,
    "lng": 101.5977
  },
  "แปลงยาว, ฉะเชิงเทรา": {
    "lat": 13.5657,
    "lng": 101.3365
  },
  "ท่าตะเกียบ, ฉะเชิงเทรา": {
    "lat": 13.4035,
    "lng": 101.689
  },
  "คลองเขื่อน, ฉะเชิงเทรา": {
    "lat": 13.7636,
    "lng": 101.1546
  },
  "เมืองปราจีนบุรี, ปราจีนบุรี": {
    "lat": 14.0783,
    "lng": 101.3763
  },
  "กบินทร์บุรี, ปราจีนบุรี": {
    "lat": 13.9373,
    "lng": 101.7667
  },
  "นาดี, ปราจีนบุรี": {
    "lat": 14.1543,
    "lng": 101.828
  },
  "บ้านสร้าง, ปราจีนบุรี": {
    "lat": 13.9424,
    "lng": 101.2447
  },
  "ประจันตคาม, ปราจีนบุรี": {
    "lat": 14.0977,
    "lng": 101.5481
  },
  "ศรีมหาโพธิ, ปราจีนบุรี": {
    "lat": 13.9126,
    "lng": 101.5213
  },
  "ศรีมโหสถ, ปราจีนบุรี": {
    "lat": 13.8925,
    "lng": 101.4105
  },
  "เมืองนครนายก, นครนายก": {
    "lat": 14.2188,
    "lng": 101.2005
  },
  "ปากพลี, นครนายก": {
    "lat": 14.1794,
    "lng": 101.2957
  },
  "บ้านนา, นครนายก": {
    "lat": 14.2556,
    "lng": 101.0556
  },
  "องครักษ์, นครนายก": {
    "lat": 14.0797,
    "lng": 101.003
  },
  "เมืองสระแก้ว, สระแก้ว": {
    "lat": 13.8741,
    "lng": 102.073
  },
  "คลองหาด, สระแก้ว": {
    "lat": 13.4929,
    "lng": 102.278
  },
  "ตาพระยา, สระแก้ว": {
    "lat": 14.0346,
    "lng": 102.7422
  },
  "วังน้ำเย็น, สระแก้ว": {
    "lat": 13.519,
    "lng": 102.1022
  },
  "วัฒนานคร, สระแก้ว": {
    "lat": 13.8452,
    "lng": 102.3506
  },
  "อรัญประเทศ, สระแก้ว": {
    "lat": 13.6741,
    "lng": 102.4797
  },
  "เขาฉกรรจ์, สระแก้ว": {
    "lat": 13.6597,
    "lng": 102.0738
  },
  "โคกสูง, สระแก้ว": {
    "lat": 13.8362,
    "lng": 102.6598
  },
  "วังสมบูรณ์, สระแก้ว": {
    "lat": 13.365,
    "lng": 102.109
  },
  "เมืองนครราชสีมา, นครราชสีมา": {
    "lat": 14.9814,
    "lng": 102.1029
  },
  "ครบุรี, นครราชสีมา": {
    "lat": 14.4739,
    "lng": 102.2428
  },
  "เสิงสาง, นครราชสีมา": {
    "lat": 14.3765,
    "lng": 102.4735
  },
  "คง, นครราชสีมา": {
    "lat": 15.4265,
    "lng": 102.3128
  },
  "บ้านเหลื่อม, นครราชสีมา": {
    "lat": 15.5767,
    "lng": 102.1208
  },
  "จักราช, นครราชสีมา": {
    "lat": 14.9696,
    "lng": 102.4409
  },
  "โชคชัย, นครราชสีมา": {
    "lat": 14.7617,
    "lng": 102.1921
  },
  "ด่านขุนทด, นครราชสีมา": {
    "lat": 15.2352,
    "lng": 101.7614
  },
  "โนนไทย, นครราชสีมา": {
    "lat": 15.191,
    "lng": 102.0287
  },
  "โนนสูง, นครราชสีมา": {
    "lat": 15.1923,
    "lng": 102.2747
  },
  "ขามสะแกแสง, นครราชสีมา": {
    "lat": 15.3863,
    "lng": 102.1719
  },
  "บัวใหญ่, นครราชสีมา": {
    "lat": 15.5789,
    "lng": 102.4015
  },
  "ประทาย, นครราชสีมา": {
    "lat": 15.5624,
    "lng": 102.7062
  },
  "ปักธงชัย, นครราชสีมา": {
    "lat": 14.6757,
    "lng": 101.991
  },
  "พิมาย, นครราชสีมา": {
    "lat": 15.2423,
    "lng": 102.5196
  },
  "ห้วยแถลง, นครราชสีมา": {
    "lat": 15.0354,
    "lng": 102.6551
  },
  "ชุมพวง, นครราชสีมา": {
    "lat": 15.2663,
    "lng": 102.7558
  },
  "สูงเนิน, นครราชสีมา": {
    "lat": 14.8882,
    "lng": 101.8422
  },
  "ขามทะเลสอ, นครราชสีมา": {
    "lat": 15.0254,
    "lng": 101.9306
  },
  "สีคิ้ว, นครราชสีมา": {
    "lat": 14.9478,
    "lng": 101.6257
  },
  "ปากช่อง, นครราชสีมา": {
    "lat": 14.6237,
    "lng": 101.4694
  },
  "หนองบุญมาก, นครราชสีมา": {
    "lat": 14.7248,
    "lng": 102.373
  },
  "แก้งสนามนาง, นครราชสีมา": {
    "lat": 15.6986,
    "lng": 102.2422
  },
  "โนนแดง, นครราชสีมา": {
    "lat": 15.4505,
    "lng": 102.5397
  },
  "วังน้ำเขียว, นครราชสีมา": {
    "lat": 14.458,
    "lng": 101.8504
  },
  "เทพารักษ์, นครราชสีมา": {
    "lat": 15.3012,
    "lng": 101.4822
  },
  "เมืองยาง, นครราชสีมา": {
    "lat": 15.4428,
    "lng": 102.886
  },
  "พระทองคำ, นครราชสีมา": {
    "lat": 15.339,
    "lng": 101.9824
  },
  "ลำทะเมนชัย, นครราชสีมา": {
    "lat": 15.3098,
    "lng": 102.9137
  },
  "บัวลาย, นครราชสีมา": {
    "lat": 15.669,
    "lng": 102.5112
  },
  "สีดา, นครราชสีมา": {
    "lat": 15.5666,
    "lng": 102.557
  },
  "เฉลิมพระเกียรติ, นครราชสีมา": {
    "lat": 14.9936,
    "lng": 102.2772
  },
  "เมืองบุรีรัมย์, บุรีรัมย์": {
    "lat": 14.9632,
    "lng": 103.0597
  },
  "คูเมือง, บุรีรัมย์": {
    "lat": 15.2606,
    "lng": 103.0407
  },
  "กระสัง, บุรีรัมย์": {
    "lat": 14.9533,
    "lng": 103.3215
  },
  "นางรอง, บุรีรัมย์": {
    "lat": 14.6351,
    "lng": 102.7644
  },
  "หนองกี่, บุรีรัมย์": {
    "lat": 14.7239,
    "lng": 102.5599
  },
  "ละหานทราย, บุรีรัมย์": {
    "lat": 14.3716,
    "lng": 102.8686
  },
  "ประโคนชัย, บุรีรัมย์": {
    "lat": 14.6156,
    "lng": 103.0567
  },
  "บ้านกรวด, บุรีรัมย์": {
    "lat": 14.4127,
    "lng": 103.1251
  },
  "พุทไธสง, บุรีรัมย์": {
    "lat": 15.5403,
    "lng": 102.9877
  },
  "ลำปลายมาศ, บุรีรัมย์": {
    "lat": 15.0238,
    "lng": 102.8761
  },
  "สตึก, บุรีรัมย์": {
    "lat": 15.2221,
    "lng": 103.3227
  },
  "ปะคำ, บุรีรัมย์": {
    "lat": 14.4226,
    "lng": 102.6738
  },
  "นาโพธิ์, บุรีรัมย์": {
    "lat": 15.6992,
    "lng": 102.9366
  },
  "หนองหงส์, บุรีรัมย์": {
    "lat": 14.8643,
    "lng": 102.6719
  },
  "พลับพลาชัย, บุรีรัมย์": {
    "lat": 14.7324,
    "lng": 103.1662
  },
  "ห้วยราช, บุรีรัมย์": {
    "lat": 15.0035,
    "lng": 103.2245
  },
  "โนนสุวรรณ, บุรีรัมย์": {
    "lat": 14.5678,
    "lng": 102.579
  },
  "ชำนิ, บุรีรัมย์": {
    "lat": 14.7777,
    "lng": 102.83
  },
  "บ้านใหม่ไชยพจน์, บุรีรัมย์": {
    "lat": 15.571,
    "lng": 102.848
  },
  "โนนดินแดง, บุรีรัมย์": {
    "lat": 14.2917,
    "lng": 102.7277
  },
  "บ้านด่าน, บุรีรัมย์": {
    "lat": 15.1305,
    "lng": 103.1887
  },
  "แคนดง, บุรีรัมย์": {
    "lat": 15.3062,
    "lng": 103.138
  },
  "เฉลิมพระเกียรติ, บุรีรัมย์": {
    "lat": 14.5612,
    "lng": 102.9016
  },
  "เมืองสุรินทร์, สุรินทร์": {
    "lat": 14.896,
    "lng": 103.515
  },
  "ชุมพลบุรี, สุรินทร์": {
    "lat": 15.38,
    "lng": 103.3583
  },
  "ท่าตูม, สุรินทร์": {
    "lat": 15.2971,
    "lng": 103.6404
  },
  "จอมพระ, สุรินทร์": {
    "lat": 15.1383,
    "lng": 103.59
  },
  "ปราสาท, สุรินทร์": {
    "lat": 14.6456,
    "lng": 103.394
  },
  "กาบเชิง, สุรินทร์": {
    "lat": 14.4712,
    "lng": 103.5928
  },
  "รัตนบุรี, สุรินทร์": {
    "lat": 15.3345,
    "lng": 103.8908
  },
  "สนม, สุรินทร์": {
    "lat": 15.1709,
    "lng": 103.7793
  },
  "ศีขรภูมิ, สุรินทร์": {
    "lat": 14.9533,
    "lng": 103.7905
  },
  "สังขะ, สุรินทร์": {
    "lat": 14.6057,
    "lng": 103.8393
  },
  "ลำดวน, สุรินทร์": {
    "lat": 14.7276,
    "lng": 103.7008
  },
  "สำโรงทาบ, สุรินทร์": {
    "lat": 15.0464,
    "lng": 103.9405
  },
  "บัวเชด, สุรินทร์": {
    "lat": 14.5217,
    "lng": 103.9703
  },
  "พนมดงรัก, สุรินทร์": {
    "lat": 14.4473,
    "lng": 103.3032
  },
  "ศรีณรงค์, สุรินทร์": {
    "lat": 14.7696,
    "lng": 103.889
  },
  "เขวาสินรินทร์, สุรินทร์": {
    "lat": 15.0074,
    "lng": 103.612
  },
  "โนนนารายณ์, สุรินทร์": {
    "lat": 15.1956,
    "lng": 103.909
  },
  "เมืองศรีสะเกษ, ศรีสะเกษ": {
    "lat": 15.0771,
    "lng": 104.3487
  },
  "ยางชุมน้อย, ศรีสะเกษ": {
    "lat": 15.2376,
    "lng": 104.3876
  },
  "กันทรารมย์, ศรีสะเกษ": {
    "lat": 15.1237,
    "lng": 104.568
  },
  "กันทรลักษ์, ศรีสะเกษ": {
    "lat": 14.6004,
    "lng": 104.6755
  },
  "ขุขันธ์, ศรีสะเกษ": {
    "lat": 14.735,
    "lng": 104.1908
  },
  "ไพรบึง, ศรีสะเกษ": {
    "lat": 14.7948,
    "lng": 104.3415
  },
  "ปรางค์กู่, ศรีสะเกษ": {
    "lat": 14.8559,
    "lng": 104.0387
  },
  "ขุนหาญ, ศรีสะเกษ": {
    "lat": 14.6087,
    "lng": 104.4198
  },
  "ราษีไศล, ศรีสะเกษ": {
    "lat": 15.3514,
    "lng": 104.1815
  },
  "อุทุมพรพิสัย, ศรีสะเกษ": {
    "lat": 15.1282,
    "lng": 104.1613
  },
  "บึงบูรพ์, ศรีสะเกษ": {
    "lat": 15.3125,
    "lng": 104.0635
  },
  "ห้วยทับทัน, ศรีสะเกษ": {
    "lat": 15.015,
    "lng": 104.0365
  },
  "โนนคูณ, ศรีสะเกษ": {
    "lat": 14.9078,
    "lng": 104.6752
  },
  "ศรีรัตนะ, ศรีสะเกษ": {
    "lat": 14.8011,
    "lng": 104.4829
  },
  "น้ำเกลี้ยง, ศรีสะเกษ": {
    "lat": 14.9183,
    "lng": 104.5257
  },
  "วังหิน, ศรีสะเกษ": {
    "lat": 14.9569,
    "lng": 104.2199
  },
  "ภูสิงห์, ศรีสะเกษ": {
    "lat": 14.5286,
    "lng": 104.1317
  },
  "เมืองจันทร์, ศรีสะเกษ": {
    "lat": 15.186,
    "lng": 104.014
  },
  "เบญจลักษ์, ศรีสะเกษ": {
    "lat": 14.7856,
    "lng": 104.684
  },
  "พยุห์, ศรีสะเกษ": {
    "lat": 14.9072,
    "lng": 104.3794
  },
  "โพธิ์ศรีสุวรรณ, ศรีสะเกษ": {
    "lat": 15.2422,
    "lng": 104.0648
  },
  "ศิลาลาด, ศรีสะเกษ": {
    "lat": 15.4835,
    "lng": 104.0945
  },
  "เมืองอุบลราชธานี, อุบลราชธานี": {
    "lat": 15.2988,
    "lng": 104.8446
  },
  "ศรีเมืองใหม่, อุบลราชธานี": {
    "lat": 15.5295,
    "lng": 105.3177
  },
  "โขงเจียม, อุบลราชธานี": {
    "lat": 15.415,
    "lng": 105.4808
  },
  "เขื่องใน, อุบลราชธานี": {
    "lat": 15.3873,
    "lng": 104.5269
  },
  "เขมราฐ, อุบลราชธานี": {
    "lat": 15.9669,
    "lng": 105.1489
  },
  "เดชอุดม, อุบลราชธานี": {
    "lat": 14.8539,
    "lng": 105.048
  },
  "นาจะหลวย, อุบลราชธานี": {
    "lat": 14.6217,
    "lng": 105.2137
  },
  "น้ำยืน, อุบลราชธานี": {
    "lat": 14.5149,
    "lng": 105.0324
  },
  "บุณฑริก, อุบลราชธานี": {
    "lat": 14.7717,
    "lng": 105.3696
  },
  "ตระการพืชผล, อุบลราชธานี": {
    "lat": 15.6173,
    "lng": 105.0575
  },
  "กุดข้าวปุ้น, อุบลราชธานี": {
    "lat": 15.804,
    "lng": 105.0392
  },
  "ม่วงสามสิบ, อุบลราชธานี": {
    "lat": 15.5277,
    "lng": 104.7182
  },
  "วารินชำราบ, อุบลราชธานี": {
    "lat": 15.1393,
    "lng": 104.8599
  },
  "พิบูลมังสาหาร, อุบลราชธานี": {
    "lat": 15.1512,
    "lng": 105.2487
  },
  "ตาลสุม, อุบลราชธานี": {
    "lat": 15.384,
    "lng": 105.1557
  },
  "โพธิ์ไทร, อุบลราชธานี": {
    "lat": 15.7923,
    "lng": 105.3335
  },
  "สำโรง, อุบลราชธานี": {
    "lat": 14.9862,
    "lng": 104.7876
  },
  "ดอนมดแดง, อุบลราชธานี": {
    "lat": 15.3837,
    "lng": 105.0073
  },
  "สิรินธร, อุบลราชธานี": {
    "lat": 15.1436,
    "lng": 105.408
  },
  "ทุ่งศรีอุดม, อุบลราชธานี": {
    "lat": 14.7434,
    "lng": 104.9142
  },
  "นาเยีย, อุบลราชธานี": {
    "lat": 15.0363,
    "lng": 105.0763
  },
  "นาตาล, อุบลราชธานี": {
    "lat": 15.9347,
    "lng": 105.281
  },
  "เหล่าเสือโก้ก, อุบลราชธานี": {
    "lat": 15.4355,
    "lng": 104.9195
  },
  "สว่างวีระวงศ์, อุบลราชธานี": {
    "lat": 15.2363,
    "lng": 105.06
  },
  "น้ำขุ่น, อุบลราชธานี": {
    "lat": 14.5595,
    "lng": 104.88
  },
  "เมืองยโสธร, ยโสธร": {
    "lat": 15.8435,
    "lng": 104.1746
  },
  "ทรายมูล, ยโสธร": {
    "lat": 15.9892,
    "lng": 104.1976
  },
  "กุดชุม, ยโสธร": {
    "lat": 16.036,
    "lng": 104.2956
  },
  "คำเขื่อนแก้ว, ยโสธร": {
    "lat": 15.6546,
    "lng": 104.3256
  },
  "ป่าติ้ว, ยโสธร": {
    "lat": 15.8214,
    "lng": 104.3758
  },
  "มหาชนะชัย, ยโสธร": {
    "lat": 15.5144,
    "lng": 104.2584
  },
  "ค้อวัง, ยโสธร": {
    "lat": 15.3785,
    "lng": 104.337
  },
  "เลิงนกทา, ยโสธร": {
    "lat": 16.2073,
    "lng": 104.4991
  },
  "ไทยเจริญ, ยโสธร": {
    "lat": 16.0796,
    "lng": 104.4518
  },
  "เมืองชัยภูมิ, ชัยภูมิ": {
    "lat": 15.8351,
    "lng": 102.0529
  },
  "บ้านเขว้า, ชัยภูมิ": {
    "lat": 15.7957,
    "lng": 101.8722
  },
  "คอนสวรรค์, ชัยภูมิ": {
    "lat": 15.9294,
    "lng": 102.2829
  },
  "เกษตรสมบูรณ์, ชัยภูมิ": {
    "lat": 16.2731,
    "lng": 101.9135
  },
  "หนองบัวแดง, ชัยภูมิ": {
    "lat": 16.1425,
    "lng": 101.645
  },
  "จัตุรัส, ชัยภูมิ": {
    "lat": 15.5672,
    "lng": 101.8361
  },
  "บำเหน็จณรงค์, ชัยภูมิ": {
    "lat": 15.4609,
    "lng": 101.661
  },
  "หนองบัวระเหว, ชัยภูมิ": {
    "lat": 15.8008,
    "lng": 101.6806
  },
  "เทพสถิต, ชัยภูมิ": {
    "lat": 15.5874,
    "lng": 101.485
  },
  "ภูเขียว, ชัยภูมิ": {
    "lat": 16.3606,
    "lng": 102.1746
  },
  "บ้านแท่น, ชัยภูมิ": {
    "lat": 16.3736,
    "lng": 102.3644
  },
  "แก้งคร้อ, ชัยภูมิ": {
    "lat": 16.1371,
    "lng": 102.2158
  },
  "คอนสาร, ชัยภูมิ": {
    "lat": 16.564,
    "lng": 101.8595
  },
  "ภักดีชุมพล, ชัยภูมิ": {
    "lat": 15.9565,
    "lng": 101.3808
  },
  "เนินสง่า, ชัยภูมิ": {
    "lat": 15.5512,
    "lng": 101.9935
  },
  "ซับใหญ่, ชัยภูมิ": {
    "lat": 15.5967,
    "lng": 101.6503
  },
  "เมืองอำนาจเจริญ, อำนาจเจริญ": {
    "lat": 15.874,
    "lng": 104.6307
  },
  "ชานุมาน, อำนาจเจริญ": {
    "lat": 16.13,
    "lng": 104.9384
  },
  "ปทุมราชวงศา, อำนาจเจริญ": {
    "lat": 15.8854,
    "lng": 104.8996
  },
  "พนา, อำนาจเจริญ": {
    "lat": 15.6913,
    "lng": 104.8708
  },
  "เสนางคนิคม, อำนาจเจริญ": {
    "lat": 16.053,
    "lng": 104.6805
  },
  "หัวตะพาน, อำนาจเจริญ": {
    "lat": 15.6888,
    "lng": 104.5247
  },
  "ลืออำนาจ, อำนาจเจริญ": {
    "lat": 15.7149,
    "lng": 104.6933
  },
  "พรเจริญ, บึงกาฬ": {
    "lat": 18.0634,
    "lng": 103.6594
  },
  "โซ่พิสัย, บึงกาฬ": {
    "lat": 18.1366,
    "lng": 103.433
  },
  "เซกา, บึงกาฬ": {
    "lat": 17.9796,
    "lng": 103.898
  },
  "ปากคาด, บึงกาฬ": {
    "lat": 18.2838,
    "lng": 103.3333
  },
  "บึงโขงหลง, บึงกาฬ": {
    "lat": 18.0248,
    "lng": 104.0777
  },
  "ศรีวิไล, บึงกาฬ": {
    "lat": 18.161,
    "lng": 103.7784
  },
  "บุ่งคล้า, บึงกาฬ": {
    "lat": 18.2547,
    "lng": 103.9657
  },
  "เมืองหนองบัวลำภู, หนองบัวลำภู": {
    "lat": 17.1679,
    "lng": 102.3947
  },
  "นากลาง, หนองบัวลำภู": {
    "lat": 17.316,
    "lng": 102.2031
  },
  "โนนสัง, หนองบัวลำภู": {
    "lat": 16.9003,
    "lng": 102.5365
  },
  "ศรีบุญเรือง, หนองบัวลำภู": {
    "lat": 17.0028,
    "lng": 102.2386
  },
  "สุวรรณคูหา, หนองบัวลำภู": {
    "lat": 17.5524,
    "lng": 102.2631
  },
  "นาวัง, หนองบัวลำภู": {
    "lat": 17.3488,
    "lng": 102.0644
  },
  "เมืองขอนแก่น, ขอนแก่น": {
    "lat": 16.453,
    "lng": 102.8181
  },
  "บ้านฝาง, ขอนแก่น": {
    "lat": 16.4733,
    "lng": 102.616
  },
  "พระยืน, ขอนแก่น": {
    "lat": 16.2962,
    "lng": 102.691
  },
  "หนองเรือ, ขอนแก่น": {
    "lat": 16.4904,
    "lng": 102.4477
  },
  "ชุมแพ, ขอนแก่น": {
    "lat": 16.5813,
    "lng": 102.1232
  },
  "สีชมพู, ขอนแก่น": {
    "lat": 16.7609,
    "lng": 102.1198
  },
  "น้ำพอง, ขอนแก่น": {
    "lat": 16.6998,
    "lng": 102.8781
  },
  "อุบลรัตน์, ขอนแก่น": {
    "lat": 16.7835,
    "lng": 102.6693
  },
  "กระนวน, ขอนแก่น": {
    "lat": 16.7439,
    "lng": 103.0821
  },
  "บ้านไผ่, ขอนแก่น": {
    "lat": 16.0343,
    "lng": 102.7637
  },
  "เปือยน้อย, ขอนแก่น": {
    "lat": 15.8878,
    "lng": 102.8755
  },
  "พล, ขอนแก่น": {
    "lat": 15.8106,
    "lng": 102.5872
  },
  "แวงใหญ่, ขอนแก่น": {
    "lat": 15.933,
    "lng": 102.4624
  },
  "แวงน้อย, ขอนแก่น": {
    "lat": 15.8048,
    "lng": 102.4087
  },
  "หนองสองห้อง, ขอนแก่น": {
    "lat": 15.7663,
    "lng": 102.7781
  },
  "ภูเวียง, ขอนแก่น": {
    "lat": 16.6719,
    "lng": 102.4458
  },
  "มัญจาคีรี, ขอนแก่น": {
    "lat": 16.2081,
    "lng": 102.5282
  },
  "ชนบท, ขอนแก่น": {
    "lat": 16.0237,
    "lng": 102.5763
  },
  "เขาสวนกวาง, ขอนแก่น": {
    "lat": 16.8998,
    "lng": 102.7934
  },
  "ภูผาม่าน, ขอนแก่น": {
    "lat": 16.6968,
    "lng": 101.8884
  },
  "ซำสูง, ขอนแก่น": {
    "lat": 16.56,
    "lng": 103.0642
  },
  "โคกโพธิ์ไชย, ขอนแก่น": {
    "lat": 16.0727,
    "lng": 102.3945
  },
  "หนองนาคำ, ขอนแก่น": {
    "lat": 16.7997,
    "lng": 102.3433
  },
  "บ้านแฮด, ขอนแก่น": {
    "lat": 16.2087,
    "lng": 102.7713
  },
  "โนนศิลา, ขอนแก่น": {
    "lat": 15.9802,
    "lng": 102.6714
  },
  "เวียงเก่า, ขอนแก่น": {
    "lat": 16.6967,
    "lng": 102.265
  },
  "เมืองอุดรธานี, อุดรธานี": {
    "lat": 17.4017,
    "lng": 102.7784
  },
  "กุดจับ, อุดรธานี": {
    "lat": 17.4381,
    "lng": 102.5331
  },
  "หนองวัวซอ, อุดรธานี": {
    "lat": 17.1995,
    "lng": 102.5841
  },
  "กุมภวาปี, อุดรธานี": {
    "lat": 17.0933,
    "lng": 102.9888
  },
  "โนนสะอาด, อุดรธานี": {
    "lat": 16.9657,
    "lng": 102.8935
  },
  "หนองหาน, อุดรธานี": {
    "lat": 17.3721,
    "lng": 103.1167
  },
  "ทุ่งฝน, อุดรธานี": {
    "lat": 17.514,
    "lng": 103.1972
  },
  "ไชยวาน, อุดรธานี": {
    "lat": 17.2312,
    "lng": 103.2485
  },
  "ศรีธาตุ, อุดรธานี": {
    "lat": 17.0129,
    "lng": 103.2156
  },
  "วังสามหมอ, อุดรธานี": {
    "lat": 17.002,
    "lng": 103.444
  },
  "บ้านดุง, อุดรธานี": {
    "lat": 17.6996,
    "lng": 103.2649
  },
  "บ้านผือ, อุดรธานี": {
    "lat": 17.6519,
    "lng": 102.4541
  },
  "น้ำโสม, อุดรธานี": {
    "lat": 17.7497,
    "lng": 102.2073
  },
  "เพ็ญ, อุดรธานี": {
    "lat": 17.6495,
    "lng": 102.9352
  },
  "สร้างคอม, อุดรธานี": {
    "lat": 17.7957,
    "lng": 103.055
  },
  "หนองแสง, อุดรธานี": {
    "lat": 17.139,
    "lng": 102.8067
  },
  "นายูง, อุดรธานี": {
    "lat": 17.9223,
    "lng": 102.1437
  },
  "พิบูลย์รักษ์, อุดรธานี": {
    "lat": 17.5273,
    "lng": 103.0727
  },
  "กู่แก้ว, อุดรธานี": {
    "lat": 17.1737,
    "lng": 103.1623
  },
  "ประจักษ์ศิลปาคม, อุดรธานี": {
    "lat": 17.2423,
    "lng": 102.9907
  },
  "เมืองเลย, เลย": {
    "lat": 17.5351,
    "lng": 101.7126
  },
  "นาด้วง, เลย": {
    "lat": 17.505,
    "lng": 101.9725
  },
  "เชียงคาน, เลย": {
    "lat": 17.8106,
    "lng": 101.7104
  },
  "ปากชม, เลย": {
    "lat": 17.8948,
    "lng": 101.9588
  },
  "ด่านซ้าย, เลย": {
    "lat": 17.2757,
    "lng": 101.2059
  },
  "นาแห้ว, เลย": {
    "lat": 17.4456,
    "lng": 100.9986
  },
  "ภูเรือ, เลย": {
    "lat": 17.411,
    "lng": 101.3955
  },
  "ท่าลี่, เลย": {
    "lat": 17.6185,
    "lng": 101.4188
  },
  "วังสะพุง, เลย": {
    "lat": 17.2779,
    "lng": 101.7532
  },
  "ภูกระดึง, เลย": {
    "lat": 16.921,
    "lng": 101.8865
  },
  "ภูหลวง, เลย": {
    "lat": 17.1098,
    "lng": 101.6594
  },
  "ผาขาว, เลย": {
    "lat": 17.0446,
    "lng": 102.005
  },
  "เอราวัณ, เลย": {
    "lat": 17.2743,
    "lng": 101.9785
  },
  "หนองหิน, เลย": {
    "lat": 17.0587,
    "lng": 101.8267
  },
  "เมืองหนองคาย, หนองคาย": {
    "lat": 17.8574,
    "lng": 102.774
  },
  "ท่าบ่อ, หนองคาย": {
    "lat": 17.7947,
    "lng": 102.5638
  },
  "โพนพิสัย, หนองคาย": {
    "lat": 17.9428,
    "lng": 103.1112
  },
  "ศรีเชียงใหม่, หนองคาย": {
    "lat": 17.9443,
    "lng": 102.5085
  },
  "สังคม, หนองคาย": {
    "lat": 18.0794,
    "lng": 102.2064
  },
  "สระใคร, หนองคาย": {
    "lat": 17.664,
    "lng": 102.717
  },
  "เฝ้าไร่, หนองคาย": {
    "lat": 17.9932,
    "lng": 103.2978
  },
  "รัตนวาปี, หนองคาย": {
    "lat": 18.2146,
    "lng": 103.2272
  },
  "โพธิ์ตาก, หนองคาย": {
    "lat": 17.884,
    "lng": 102.4247
  },
  "เมืองมหาสารคาม, มหาสารคาม": {
    "lat": 16.1163,
    "lng": 103.3171
  },
  "แกดำ, มหาสารคาม": {
    "lat": 16.0514,
    "lng": 103.405
  },
  "โกสุมพิสัย, มหาสารคาม": {
    "lat": 16.2496,
    "lng": 103.0159
  },
  "กันทรวิชัย, มหาสารคาม": {
    "lat": 16.2846,
    "lng": 103.2811
  },
  "เชียงยืน, มหาสารคาม": {
    "lat": 16.4016,
    "lng": 103.0839
  },
  "บรบือ, มหาสารคาม": {
    "lat": 15.9759,
    "lng": 103.1381
  },
  "นาเชือก, มหาสารคาม": {
    "lat": 15.8015,
    "lng": 103.0386
  },
  "พยัคฆภูมิพิสัย, มหาสารคาม": {
    "lat": 15.5334,
    "lng": 103.2325
  },
  "วาปีปทุม, มหาสารคาม": {
    "lat": 15.8651,
    "lng": 103.3557
  },
  "นาดูน, มหาสารคาม": {
    "lat": 15.7227,
    "lng": 103.2437
  },
  "ยางสีสุราช, มหาสารคาม": {
    "lat": 15.6615,
    "lng": 103.1032
  },
  "กุดรัง, มหาสารคาม": {
    "lat": 16.0492,
    "lng": 102.9702
  },
  "ชื่นชม, มหาสารคาม": {
    "lat": 16.5265,
    "lng": 103.1378
  },
  "เมืองร้อยเอ็ด, ร้อยเอ็ด": {
    "lat": 16.0061,
    "lng": 103.6203
  },
  "เกษตรวิสัย, ร้อยเอ็ด": {
    "lat": 15.6232,
    "lng": 103.5598
  },
  "ปทุมรัตต์, ร้อยเอ็ด": {
    "lat": 15.6284,
    "lng": 103.389
  },
  "จตุรพักตรพิมาน, ร้อยเอ็ด": {
    "lat": 15.8262,
    "lng": 103.5514
  },
  "ธวัชบุรี, ร้อยเอ็ด": {
    "lat": 16.0311,
    "lng": 103.7763
  },
  "พนมไพร, ร้อยเอ็ด": {
    "lat": 15.6866,
    "lng": 104.0803
  },
  "โพนทอง, ร้อยเอ็ด": {
    "lat": 16.2743,
    "lng": 103.9569
  },
  "โพธิ์ชัย, ร้อยเอ็ด": {
    "lat": 16.2978,
    "lng": 103.7926
  },
  "หนองพอก, ร้อยเอ็ด": {
    "lat": 16.3018,
    "lng": 104.2147
  },
  "เสลภูมิ, ร้อยเอ็ด": {
    "lat": 16.0623,
    "lng": 103.9852
  },
  "สุวรรณภูมิ, ร้อยเอ็ด": {
    "lat": 15.6234,
    "lng": 103.8349
  },
  "เมืองสรวง, ร้อยเอ็ด": {
    "lat": 15.7878,
    "lng": 103.7492
  },
  "โพนทราย, ร้อยเอ็ด": {
    "lat": 15.488,
    "lng": 103.9396
  },
  "อาจสามารถ, ร้อยเอ็ด": {
    "lat": 15.847,
    "lng": 103.8637
  },
  "เมยวดี, ร้อยเอ็ด": {
    "lat": 16.3865,
    "lng": 104.1137
  },
  "ศรีสมเด็จ, ร้อยเอ็ด": {
    "lat": 16.0094,
    "lng": 103.5115
  },
  "จังหาร, ร้อยเอ็ด": {
    "lat": 16.1655,
    "lng": 103.6107
  },
  "เชียงขวัญ, ร้อยเอ็ด": {
    "lat": 16.1442,
    "lng": 103.7385
  },
  "หนองฮี, ร้อยเอ็ด": {
    "lat": 15.578,
    "lng": 104.0108
  },
  "ทุ่งเขาหลวง, ร้อยเอ็ด": {
    "lat": 15.997,
    "lng": 103.8658
  },
  "เมืองกาฬสินธุ์, กาฬสินธุ์": {
    "lat": 16.5105,
    "lng": 103.5513
  },
  "นามน, กาฬสินธุ์": {
    "lat": 16.5784,
    "lng": 103.7958
  },
  "กมลาไสย, กาฬสินธุ์": {
    "lat": 16.2926,
    "lng": 103.6001
  },
  "ร่องคำ, กาฬสินธุ์": {
    "lat": 16.2793,
    "lng": 103.7193
  },
  "กุฉินารายณ์, กาฬสินธุ์": {
    "lat": 16.5225,
    "lng": 104.0499
  },
  "เขาวง, กาฬสินธุ์": {
    "lat": 16.6943,
    "lng": 104.094
  },
  "ยางตลาด, กาฬสินธุ์": {
    "lat": 16.4378,
    "lng": 103.3674
  },
  "ห้วยเม็ก, กาฬสินธุ์": {
    "lat": 16.6122,
    "lng": 103.2418
  },
  "สหัสขันธ์, กาฬสินธุ์": {
    "lat": 16.7176,
    "lng": 103.5619
  },
  "คำม่วง, กาฬสินธุ์": {
    "lat": 16.9082,
    "lng": 103.6627
  },
  "ท่าคันโท, กาฬสินธุ์": {
    "lat": 16.8667,
    "lng": 103.2453
  },
  "หนองกุงศรี, กาฬสินธุ์": {
    "lat": 16.7289,
    "lng": 103.3269
  },
  "สมเด็จ, กาฬสินธุ์": {
    "lat": 16.7541,
    "lng": 103.7488
  },
  "ห้วยผึ้ง, กาฬสินธุ์": {
    "lat": 16.6605,
    "lng": 103.9068
  },
  "สามชัย, กาฬสินธุ์": {
    "lat": 16.8738,
    "lng": 103.5298
  },
  "นาคู, กาฬสินธุ์": {
    "lat": 16.762,
    "lng": 104.0242
  },
  "ดอนจาน, กาฬสินธุ์": {
    "lat": 16.4627,
    "lng": 103.701
  },
  "ฆ้องชัย, กาฬสินธุ์": {
    "lat": 16.2595,
    "lng": 103.4848
  },
  "เมืองสกลนคร, สกลนคร": {
    "lat": 17.1665,
    "lng": 104.1448
  },
  "กุสุมาลย์, สกลนคร": {
    "lat": 17.35,
    "lng": 104.2808
  },
  "กุดบาก, สกลนคร": {
    "lat": 17.0813,
    "lng": 103.788
  },
  "พรรณานิคม, สกลนคร": {
    "lat": 17.3289,
    "lng": 103.8988
  },
  "พังโคน, สกลนคร": {
    "lat": 17.386,
    "lng": 103.7456
  },
  "วาริชภูมิ, สกลนคร": {
    "lat": 17.2758,
    "lng": 103.5868
  },
  "นิคมน้ำอูน, สกลนคร": {
    "lat": 17.1562,
    "lng": 103.7332
  },
  "วานรนิวาส, สกลนคร": {
    "lat": 17.6517,
    "lng": 103.7293
  },
  "คำตากล้า, สกลนคร": {
    "lat": 17.829,
    "lng": 103.7885
  },
  "บ้านม่วง, สกลนคร": {
    "lat": 17.8898,
    "lng": 103.5307
  },
  "อากาศอำนวย, สกลนคร": {
    "lat": 17.6423,
    "lng": 103.9735
  },
  "สว่างแดนดิน, สกลนคร": {
    "lat": 17.443,
    "lng": 103.4573
  },
  "ส่องดาว, สกลนคร": {
    "lat": 17.3235,
    "lng": 103.4645
  },
  "เต่างอย, สกลนคร": {
    "lat": 16.969,
    "lng": 104.1675
  },
  "โคกศรีสุพรรณ, สกลนคร": {
    "lat": 17.0378,
    "lng": 104.3137
  },
  "เจริญศิลป์, สกลนคร": {
    "lat": 17.6222,
    "lng": 103.5322
  },
  "โพนนาแก้ว, สกลนคร": {
    "lat": 17.2124,
    "lng": 104.31
  },
  "ภูพาน, สกลนคร": {
    "lat": 16.9262,
    "lng": 103.9603
  },
  "เมืองนครพนม, นครพนม": {
    "lat": 17.3223,
    "lng": 104.6956
  },
  "ปลาปาก, นครพนม": {
    "lat": 17.1883,
    "lng": 104.5321
  },
  "ท่าอุเทน, นครพนม": {
    "lat": 17.6168,
    "lng": 104.4987
  },
  "บ้านแพง, นครพนม": {
    "lat": 17.912,
    "lng": 104.2002
  },
  "ธาตุพนม, นครพนม": {
    "lat": 16.9956,
    "lng": 104.7054
  },
  "เรณูนคร, นครพนม": {
    "lat": 17.0413,
    "lng": 104.6522
  },
  "นาแก, นครพนม": {
    "lat": 16.9475,
    "lng": 104.4883
  },
  "ศรีสงคราม, นครพนม": {
    "lat": 17.6273,
    "lng": 104.2396
  },
  "นาหว้า, นครพนม": {
    "lat": 17.5127,
    "lng": 104.08
  },
  "โพนสวรรค์, นครพนม": {
    "lat": 17.4662,
    "lng": 104.4146
  },
  "นาทม, นครพนม": {
    "lat": 17.8363,
    "lng": 104.0973
  },
  "วังยาง, นครพนม": {
    "lat": 17.075,
    "lng": 104.4505
  },
  "เมืองมุกดาหาร, มุกดาหาร": {
    "lat": 16.5614,
    "lng": 104.6188
  },
  "นิคมคำสร้อย, มุกดาหาร": {
    "lat": 16.3553,
    "lng": 104.551
  },
  "ดอนตาล, มุกดาหาร": {
    "lat": 16.3149,
    "lng": 104.8217
  },
  "ดงหลวง, มุกดาหาร": {
    "lat": 16.7972,
    "lng": 104.4617
  },
  "คำชะอี, มุกดาหาร": {
    "lat": 16.612,
    "lng": 104.3877
  },
  "หนองสูง, มุกดาหาร": {
    "lat": 16.4488,
    "lng": 104.3608
  },
  "เมืองเชียงใหม่, เชียงใหม่": {
    "lat": 18.7885,
    "lng": 98.9942
  },
  "จอมทอง, เชียงใหม่": {
    "lat": 18.3657,
    "lng": 98.6427
  },
  "แม่แจ่ม, เชียงใหม่": {
    "lat": 18.5326,
    "lng": 98.3086
  },
  "เชียงดาว, เชียงใหม่": {
    "lat": 19.4731,
    "lng": 98.9063
  },
  "ดอยสะเก็ด, เชียงใหม่": {
    "lat": 18.8552,
    "lng": 99.1496
  },
  "แม่แตง, เชียงใหม่": {
    "lat": 19.1505,
    "lng": 98.8922
  },
  "แม่ริม, เชียงใหม่": {
    "lat": 18.9298,
    "lng": 98.9218
  },
  "สะเมิง, เชียงใหม่": {
    "lat": 18.9074,
    "lng": 98.6324
  },
  "ฝาง, เชียงใหม่": {
    "lat": 19.9088,
    "lng": 99.1655
  },
  "แม่อาย, เชียงใหม่": {
    "lat": 19.9983,
    "lng": 99.3037
  },
  "พร้าว, เชียงใหม่": {
    "lat": 19.3337,
    "lng": 99.2025
  },
  "สันป่าตอง, เชียงใหม่": {
    "lat": 18.6019,
    "lng": 98.8831
  },
  "สันกำแพง, เชียงใหม่": {
    "lat": 18.7464,
    "lng": 99.1418
  },
  "สันทราย, เชียงใหม่": {
    "lat": 18.8826,
    "lng": 99.0482
  },
  "หางดง, เชียงใหม่": {
    "lat": 18.6927,
    "lng": 98.9306
  },
  "ฮอด, เชียงใหม่": {
    "lat": 18.1122,
    "lng": 98.4863
  },
  "ดอยเต่า, เชียงใหม่": {
    "lat": 17.9392,
    "lng": 98.6705
  },
  "อมก๋อย, เชียงใหม่": {
    "lat": 17.6572,
    "lng": 98.3325
  },
  "สารภี, เชียงใหม่": {
    "lat": 18.6984,
    "lng": 99.0217
  },
  "เวียงแหง, เชียงใหม่": {
    "lat": 19.6073,
    "lng": 98.6547
  },
  "ไชยปราการ, เชียงใหม่": {
    "lat": 19.715,
    "lng": 99.1607
  },
  "แม่วาง, เชียงใหม่": {
    "lat": 18.628,
    "lng": 98.7598
  },
  "แม่ออน, เชียงใหม่": {
    "lat": 18.7588,
    "lng": 99.2895
  },
  "ดอยหล่อ, เชียงใหม่": {
    "lat": 18.5333,
    "lng": 98.7758
  },
  "กัลยาณิวัฒนา, เชียงใหม่": {
    "lat": 19.019,
    "lng": 98.293
  },
  "เมืองลำพูน, ลำพูน": {
    "lat": 18.5691,
    "lng": 99.0196
  },
  "แม่ทา, ลำพูน": {
    "lat": 18.3888,
    "lng": 99.0657
  },
  "บ้านโฮ่ง, ลำพูน": {
    "lat": 18.3152,
    "lng": 98.7846
  },
  "ลี้, ลำพูน": {
    "lat": 17.8092,
    "lng": 98.925
  },
  "ทุ่งหัวช้าง, ลำพูน": {
    "lat": 17.9863,
    "lng": 99.054
  },
  "ป่าซาง, ลำพูน": {
    "lat": 18.473,
    "lng": 98.9021
  },
  "บ้านธิ, ลำพูน": {
    "lat": 18.6465,
    "lng": 99.1765
  },
  "เวียงหนองล่อง, ลำพูน": {
    "lat": 18.4137,
    "lng": 98.752
  },
  "เมืองลำปาง, ลำปาง": {
    "lat": 18.3704,
    "lng": 99.5117
  },
  "แม่เมาะ, ลำปาง": {
    "lat": 18.3675,
    "lng": 99.7865
  },
  "เกาะคา, ลำปาง": {
    "lat": 18.1668,
    "lng": 99.3554
  },
  "เสริมงาม, ลำปาง": {
    "lat": 18.079,
    "lng": 99.173
  },
  "งาว, ลำปาง": {
    "lat": 18.7662,
    "lng": 99.9308
  },
  "แจ้ห่ม, ลำปาง": {
    "lat": 18.7423,
    "lng": 99.6336
  },
  "วังเหนือ, ลำปาง": {
    "lat": 19.1376,
    "lng": 99.6296
  },
  "เถิน, ลำปาง": {
    "lat": 17.5957,
    "lng": 99.2481
  },
  "แม่พริก, ลำปาง": {
    "lat": 17.507,
    "lng": 99.098
  },
  "แม่ทะ, ลำปาง": {
    "lat": 18.1057,
    "lng": 99.549
  },
  "สบปราบ, ลำปาง": {
    "lat": 17.8987,
    "lng": 99.346
  },
  "ห้างฉัตร, ลำปาง": {
    "lat": 18.337,
    "lng": 99.3134
  },
  "เมืองปาน, ลำปาง": {
    "lat": 18.7672,
    "lng": 99.4858
  },
  "เมืองอุตรดิตถ์, อุตรดิตถ์": {
    "lat": 17.6529,
    "lng": 100.2016
  },
  "ตรอน, อุตรดิตถ์": {
    "lat": 17.4626,
    "lng": 100.1154
  },
  "ท่าปลา, อุตรดิตถ์": {
    "lat": 17.8322,
    "lng": 100.4075
  },
  "น้ำปาด, อุตรดิตถ์": {
    "lat": 17.7364,
    "lng": 100.7338
  },
  "ฟากท่า, อุตรดิตถ์": {
    "lat": 17.9667,
    "lng": 100.862
  },
  "บ้านโคก, อุตรดิตถ์": {
    "lat": 18.0817,
    "lng": 101.047
  },
  "พิชัย, อุตรดิตถ์": {
    "lat": 17.2865,
    "lng": 100.1067
  },
  "ลับแล, อุตรดิตถ์": {
    "lat": 17.6363,
    "lng": 100.0157
  },
  "ทองแสนขัน, อุตรดิตถ์": {
    "lat": 17.5138,
    "lng": 100.3342
  },
  "เมืองแพร่, แพร่": {
    "lat": 18.1588,
    "lng": 100.2005
  },
  "ร้องกวาง, แพร่": {
    "lat": 18.3305,
    "lng": 100.3395
  },
  "ลอง, แพร่": {
    "lat": 18.0826,
    "lng": 99.8526
  },
  "สูงเม่น, แพร่": {
    "lat": 18.0592,
    "lng": 100.1183
  },
  "เด่นชัย, แพร่": {
    "lat": 17.9524,
    "lng": 100.0362
  },
  "สอง, แพร่": {
    "lat": 18.46,
    "lng": 100.2004
  },
  "วังชิ้น, แพร่": {
    "lat": 17.8731,
    "lng": 99.581
  },
  "หนองม่วงไข่, แพร่": {
    "lat": 18.2865,
    "lng": 100.1775
  },
  "เมืองน่าน, น่าน": {
    "lat": 18.8109,
    "lng": 100.7086
  },
  "แม่จริม, น่าน": {
    "lat": 18.6998,
    "lng": 101.0126
  },
  "บ้านหลวง, น่าน": {
    "lat": 18.849,
    "lng": 100.4357
  },
  "นาน้อย, น่าน": {
    "lat": 18.3159,
    "lng": 100.6924
  },
  "ปัว, น่าน": {
    "lat": 19.1741,
    "lng": 100.9535
  },
  "ท่าวังผา, น่าน": {
    "lat": 19.107,
    "lng": 100.7961
  },
  "เวียงสา, น่าน": {
    "lat": 18.5806,
    "lng": 100.7419
  },
  "ทุ่งช้าง, น่าน": {
    "lat": 19.4715,
    "lng": 100.8672
  },
  "เชียงกลาง, น่าน": {
    "lat": 19.2927,
    "lng": 100.886
  },
  "นาหมื่น, น่าน": {
    "lat": 18.1492,
    "lng": 100.6095
  },
  "สันติสุข, น่าน": {
    "lat": 18.918,
    "lng": 100.945
  },
  "บ่อเกลือ, น่าน": {
    "lat": 19.1542,
    "lng": 101.1762
  },
  "สองแคว, น่าน": {
    "lat": 19.395,
    "lng": 100.654
  },
  "ภูเพียง, น่าน": {
    "lat": 18.757,
    "lng": 100.8417
  },
  "เฉลิมพระเกียรติ, น่าน": {
    "lat": 19.5045,
    "lng": 101.087
  },
  "เมืองพะเยา, พะเยา": {
    "lat": 19.1644,
    "lng": 99.8411
  },
  "จุน, พะเยา": {
    "lat": 19.3774,
    "lng": 100.1376
  },
  "เชียงคำ, พะเยา": {
    "lat": 19.4993,
    "lng": 100.3126
  },
  "เชียงม่วน, พะเยา": {
    "lat": 18.9163,
    "lng": 100.3193
  },
  "ดอกคำใต้, พะเยา": {
    "lat": 19.1526,
    "lng": 100.0325
  },
  "ปง, พะเยา": {
    "lat": 19.1987,
    "lng": 100.3589
  },
  "แม่ใจ, พะเยา": {
    "lat": 19.3702,
    "lng": 99.7908
  },
  "ภูซาง, พะเยา": {
    "lat": 19.617,
    "lng": 100.3542
  },
  "ภูกามยาว, พะเยา": {
    "lat": 19.264,
    "lng": 99.98
  },
  "เมืองเชียงราย, เชียงราย": {
    "lat": 19.8986,
    "lng": 99.807
  },
  "เวียงชัย, เชียงราย": {
    "lat": 19.8778,
    "lng": 99.9754
  },
  "เชียงของ, เชียงราย": {
    "lat": 20.1553,
    "lng": 100.3433
  },
  "เทิง, เชียงราย": {
    "lat": 19.6643,
    "lng": 100.1477
  },
  "พาน, เชียงราย": {
    "lat": 19.5683,
    "lng": 99.7643
  },
  "ป่าแดด, เชียงราย": {
    "lat": 19.4962,
    "lng": 99.9754
  },
  "แม่จัน, เชียงราย": {
    "lat": 20.1966,
    "lng": 99.8933
  },
  "เชียงแสน, เชียงราย": {
    "lat": 20.2782,
    "lng": 100.1125
  },
  "แม่สาย, เชียงราย": {
    "lat": 20.3634,
    "lng": 99.9177
  },
  "แม่สรวย, เชียงราย": {
    "lat": 19.6599,
    "lng": 99.4856
  },
  "เวียงป่าเป้า, เชียงราย": {
    "lat": 19.262,
    "lng": 99.4541
  },
  "พญาเม็งราย, เชียงราย": {
    "lat": 19.8898,
    "lng": 100.166
  },
  "เวียงแก่น, เชียงราย": {
    "lat": 20.0518,
    "lng": 100.497
  },
  "ขุนตาล, เชียงราย": {
    "lat": 19.8583,
    "lng": 100.2703
  },
  "แม่ฟ้าหลวง, เชียงราย": {
    "lat": 20.2323,
    "lng": 99.6865
  },
  "แม่ลาว, เชียงราย": {
    "lat": 19.7802,
    "lng": 99.7106
  },
  "เวียงเชียงรุ้ง, เชียงราย": {
    "lat": 20.0243,
    "lng": 100.0583
  },
  "ดอยหลวง, เชียงราย": {
    "lat": 20.1397,
    "lng": 100.1283
  },
  "เมืองแม่ฮ่องสอน, แม่ฮ่องสอน": {
    "lat": 19.264,
    "lng": 97.9847
  },
  "ขุนยวม, แม่ฮ่องสอน": {
    "lat": 18.8048,
    "lng": 97.911
  },
  "ปาย, แม่ฮ่องสอน": {
    "lat": 19.3289,
    "lng": 98.4187
  },
  "แม่สะเรียง, แม่ฮ่องสอน": {
    "lat": 18.2181,
    "lng": 97.8804
  },
  "แม่ลาน้อย, แม่ฮ่องสอน": {
    "lat": 18.4875,
    "lng": 98.0119
  },
  "สบเมย, แม่ฮ่องสอน": {
    "lat": 17.954,
    "lng": 97.9978
  },
  "ปางมะผ้า, แม่ฮ่องสอน": {
    "lat": 19.5772,
    "lng": 98.199
  },
  "เมืองนครสวรรค์, นครสวรรค์": {
    "lat": 15.7141,
    "lng": 100.1196
  },
  "โกรกพระ, นครสวรรค์": {
    "lat": 15.576,
    "lng": 100.021
  },
  "ชุมแสง, นครสวรรค์": {
    "lat": 15.8536,
    "lng": 100.2898
  },
  "หนองบัว, นครสวรรค์": {
    "lat": 15.8606,
    "lng": 100.5633
  },
  "บรรพตพิสัย, นครสวรรค์": {
    "lat": 15.9828,
    "lng": 99.9847
  },
  "เก้าเลี้ยว, นครสวรรค์": {
    "lat": 15.8616,
    "lng": 100.0892
  },
  "ตาคลี, นครสวรรค์": {
    "lat": 15.2307,
    "lng": 100.3998
  },
  "ท่าตะโก, นครสวรรค์": {
    "lat": 15.6621,
    "lng": 100.4538
  },
  "ไพศาลี, นครสวรรค์": {
    "lat": 15.5909,
    "lng": 100.6806
  },
  "พยุหะคีรี, นครสวรรค์": {
    "lat": 15.4822,
    "lng": 100.1655
  },
  "ลาดยาว, นครสวรรค์": {
    "lat": 15.751,
    "lng": 99.8042
  },
  "ตากฟ้า, นครสวรรค์": {
    "lat": 15.3537,
    "lng": 100.4763
  },
  "แม่วงก์, นครสวรรค์": {
    "lat": 15.8412,
    "lng": 99.507
  },
  "แม่เปิน, นครสวรรค์": {
    "lat": 15.738,
    "lng": 99.294
  },
  "ชุมตาบง, นครสวรรค์": {
    "lat": 15.6575,
    "lng": 99.566
  },
  "เมืองอุทัยธานี, อุทัยธานี": {
    "lat": 15.4041,
    "lng": 100.0221
  },
  "ทัพทัน, อุทัยธานี": {
    "lat": 15.482,
    "lng": 99.8561
  },
  "สว่างอารมณ์, อุทัยธานี": {
    "lat": 15.587,
    "lng": 99.8
  },
  "หนองฉาง, อุทัยธานี": {
    "lat": 15.3778,
    "lng": 99.7923
  },
  "หนองขาหย่าง, อุทัยธานี": {
    "lat": 15.3617,
    "lng": 99.9454
  },
  "บ้านไร่, อุทัยธานี": {
    "lat": 15.1425,
    "lng": 99.5678
  },
  "ลานสัก, อุทัยธานี": {
    "lat": 15.4672,
    "lng": 99.5428
  },
  "ห้วยคต, อุทัยธานี": {
    "lat": 15.2873,
    "lng": 99.565
  },
  "เมืองกำแพงเพชร, กำแพงเพชร": {
    "lat": 16.4357,
    "lng": 99.5127
  },
  "ไทรงาม, กำแพงเพชร": {
    "lat": 16.4443,
    "lng": 99.8561
  },
  "คลองลาน, กำแพงเพชร": {
    "lat": 16.2415,
    "lng": 99.2505
  },
  "ขาณุวรลักษบุรี, กำแพงเพชร": {
    "lat": 16.0445,
    "lng": 99.7314
  },
  "คลองขลุง, กำแพงเพชร": {
    "lat": 16.2296,
    "lng": 99.7059
  },
  "พรานกระต่าย, กำแพงเพชร": {
    "lat": 16.7041,
    "lng": 99.5807
  },
  "ลานกระบือ, กำแพงเพชร": {
    "lat": 16.5961,
    "lng": 99.8616
  },
  "ทรายทองวัฒนา, กำแพงเพชร": {
    "lat": 16.311,
    "lng": 99.892
  },
  "ปางศิลาทอง, กำแพงเพชร": {
    "lat": 16.0597,
    "lng": 99.3723
  },
  "บึงสามัคคี, กำแพงเพชร": {
    "lat": 16.2145,
    "lng": 99.9415
  },
  "โกสัมพีนคร, กำแพงเพชร": {
    "lat": 16.554,
    "lng": 99.335
  },
  "เมืองตาก, ตาก": {
    "lat": 16.8816,
    "lng": 99.1655
  },
  "บ้านตาก, ตาก": {
    "lat": 17.1007,
    "lng": 99.0903
  },
  "สามเงา, ตาก": {
    "lat": 17.2637,
    "lng": 99.0363
  },
  "แม่ระมาด, ตาก": {
    "lat": 17.0438,
    "lng": 98.5982
  },
  "ท่าสองยาง, ตาก": {
    "lat": 17.4633,
    "lng": 98.1232
  },
  "แม่สอด, ตาก": {
    "lat": 16.7043,
    "lng": 98.6535
  },
  "พบพระ, ตาก": {
    "lat": 16.4518,
    "lng": 98.769
  },
  "อุ้มผาง, ตาก": {
    "lat": 15.951,
    "lng": 98.8623
  },
  "วังเจ้า, ตาก": {
    "lat": 16.6747,
    "lng": 99.154
  },
  "เมืองสุโขทัย, สุโขทัย": {
    "lat": 17.0192,
    "lng": 99.8091
  },
  "บ้านด่านลานหอย, สุโขทัย": {
    "lat": 17.0243,
    "lng": 99.5174
  },
  "คีรีมาศ, สุโขทัย": {
    "lat": 16.8318,
    "lng": 99.7619
  },
  "กงไกรลาศ, สุโขทัย": {
    "lat": 16.944,
    "lng": 99.9836
  },
  "ศรีสัชนาลัย, สุโขทัย": {
    "lat": 17.5287,
    "lng": 99.7666
  },
  "ศรีสำโรง, สุโขทัย": {
    "lat": 17.1566,
    "lng": 99.8022
  },
  "สวรรคโลก, สุโขทัย": {
    "lat": 17.2881,
    "lng": 99.8264
  },
  "ศรีนคร, สุโขทัย": {
    "lat": 17.372,
    "lng": 99.9674
  },
  "ทุ่งเสลี่ยม, สุโขทัย": {
    "lat": 17.3284,
    "lng": 99.5846
  },
  "เมืองพิษณุโลก, พิษณุโลก": {
    "lat": 16.822,
    "lng": 100.2554
  },
  "นครไทย, พิษณุโลก": {
    "lat": 17.1337,
    "lng": 100.8493
  },
  "ชาติตระการ, พิษณุโลก": {
    "lat": 17.3235,
    "lng": 100.6378
  },
  "บางระกำ, พิษณุโลก": {
    "lat": 16.7105,
    "lng": 100.0464
  },
  "บางกระทุ่ม, พิษณุโลก": {
    "lat": 16.5887,
    "lng": 100.3313
  },
  "พรหมพิราม, พิษณุโลก": {
    "lat": 17.0602,
    "lng": 100.1512
  },
  "วัดโบสถ์, พิษณุโลก": {
    "lat": 17.0872,
    "lng": 100.3372
  },
  "วังทอง, พิษณุโลก": {
    "lat": 16.7848,
    "lng": 100.479
  },
  "เนินมะปราง, พิษณุโลก": {
    "lat": 16.527,
    "lng": 100.6649
  },
  "เมืองพิจิตร, พิจิตร": {
    "lat": 16.4214,
    "lng": 100.3562
  },
  "วังทรายพูน, พิจิตร": {
    "lat": 16.3768,
    "lng": 100.5525
  },
  "โพธิ์ประทับช้าง, พิจิตร": {
    "lat": 16.3123,
    "lng": 100.1917
  },
  "ตะพานหิน, พิจิตร": {
    "lat": 16.2022,
    "lng": 100.4114
  },
  "บางมูลนาก, พิจิตร": {
    "lat": 16.0387,
    "lng": 100.4384
  },
  "โพทะเล, พิจิตร": {
    "lat": 16.0497,
    "lng": 100.2655
  },
  "สามง่าม, พิจิตร": {
    "lat": 16.4624,
    "lng": 100.1648
  },
  "ทับคล้อ, พิจิตร": {
    "lat": 16.1855,
    "lng": 100.598
  },
  "สากเหล็ก, พิจิตร": {
    "lat": 16.5186,
    "lng": 100.5316
  },
  "บึงนาราง, พิจิตร": {
    "lat": 16.1842,
    "lng": 100.145
  },
  "ดงเจริญ, พิจิตร": {
    "lat": 16.0092,
    "lng": 100.6204
  },
  "วชิรบารมี, พิจิตร": {
    "lat": 16.5348,
    "lng": 100.0965
  },
  "เมืองเพชรบูรณ์, เพชรบูรณ์": {
    "lat": 16.3747,
    "lng": 101.1637
  },
  "ชนแดน, เพชรบูรณ์": {
    "lat": 16.1227,
    "lng": 100.8139
  },
  "หล่มสัก, เพชรบูรณ์": {
    "lat": 16.7499,
    "lng": 101.2476
  },
  "หล่มเก่า, เพชรบูรณ์": {
    "lat": 16.939,
    "lng": 101.2377
  },
  "วิเชียรบุรี, เพชรบูรณ์": {
    "lat": 15.6559,
    "lng": 101.076
  },
  "ศรีเทพ, เพชรบูรณ์": {
    "lat": 15.4387,
    "lng": 101.1006
  },
  "หนองไผ่, เพชรบูรณ์": {
    "lat": 16.0153,
    "lng": 101.1119
  },
  "บึงสามพัน, เพชรบูรณ์": {
    "lat": 15.8289,
    "lng": 100.9789
  },
  "น้ำหนาว, เพชรบูรณ์": {
    "lat": 16.8365,
    "lng": 101.6158
  },
  "วังโป่ง, เพชรบูรณ์": {
    "lat": 16.3352,
    "lng": 100.7834
  },
  "เขาค้อ, เพชรบูรณ์": {
    "lat": 16.6576,
    "lng": 100.9913
  },
  "เมืองราชบุรี, ราชบุรี": {
    "lat": 13.5438,
    "lng": 99.8045
  },
  "จอมบึง, ราชบุรี": {
    "lat": 13.6517,
    "lng": 99.5272
  },
  "สวนผึ้ง, ราชบุรี": {
    "lat": 13.5325,
    "lng": 99.3413
  },
  "ดำเนินสะดวก, ราชบุรี": {
    "lat": 13.5553,
    "lng": 99.969
  },
  "บ้านโป่ง, ราชบุรี": {
    "lat": 13.8131,
    "lng": 99.8535
  },
  "บางแพ, ราชบุรี": {
    "lat": 13.6749,
    "lng": 99.9724
  },
  "โพธาราม, ราชบุรี": {
    "lat": 13.6967,
    "lng": 99.8151
  },
  "ปากท่อ, ราชบุรี": {
    "lat": 13.3831,
    "lng": 99.762
  },
  "วัดเพลง, ราชบุรี": {
    "lat": 13.4487,
    "lng": 99.865
  },
  "บ้านคา, ราชบุรี": {
    "lat": 13.383,
    "lng": 99.4307
  },
  "เมืองกาญจนบุรี, กาญจนบุรี": {
    "lat": 14.0555,
    "lng": 99.4145
  },
  "ไทรโยค, กาญจนบุรี": {
    "lat": 14.1784,
    "lng": 99.0234
  },
  "บ่อพลอย, กาญจนบุรี": {
    "lat": 14.3894,
    "lng": 99.4404
  },
  "ศรีสวัสดิ์, กาญจนบุรี": {
    "lat": 14.638,
    "lng": 99.099
  },
  "ท่ามะกา, กาญจนบุรี": {
    "lat": 13.9321,
    "lng": 99.7857
  },
  "ท่าม่วง, กาญจนบุรี": {
    "lat": 13.9323,
    "lng": 99.6227
  },
  "ทองผาภูมิ, กาญจนบุรี": {
    "lat": 14.7284,
    "lng": 98.6827
  },
  "สังขละบุรี, กาญจนบุรี": {
    "lat": 15.152,
    "lng": 98.5167
  },
  "พนมทวน, กาญจนบุรี": {
    "lat": 14.1285,
    "lng": 99.6984
  },
  "เลาขวัญ, กาญจนบุรี": {
    "lat": 14.6019,
    "lng": 99.6964
  },
  "ด่านมะขามเตี้ย, กาญจนบุรี": {
    "lat": 13.8338,
    "lng": 99.3695
  },
  "หนองปรือ, กาญจนบุรี": {
    "lat": 14.6673,
    "lng": 99.4397
  },
  "ห้วยกระเจา, กาญจนบุรี": {
    "lat": 14.3487,
    "lng": 99.67
  },
  "เมืองสุพรรณบุรี, สุพรรณบุรี": {
    "lat": 14.4804,
    "lng": 100.0933
  },
  "เดิมบางนางบวช, สุพรรณบุรี": {
    "lat": 14.871,
    "lng": 100.0612
  },
  "ด่านช้าง, สุพรรณบุรี": {
    "lat": 14.869,
    "lng": 99.5399
  },
  "บางปลาม้า, สุพรรณบุรี": {
    "lat": 14.3534,
    "lng": 100.143
  },
  "ศรีประจันต์, สุพรรณบุรี": {
    "lat": 14.63,
    "lng": 100.145
  },
  "ดอนเจดีย์, สุพรรณบุรี": {
    "lat": 14.6516,
    "lng": 99.9256
  },
  "สองพี่น้อง, สุพรรณบุรี": {
    "lat": 14.2101,
    "lng": 100.0312
  },
  "สามชุก, สุพรรณบุรี": {
    "lat": 14.7571,
    "lng": 100.0693
  },
  "อู่ทอง, สุพรรณบุรี": {
    "lat": 14.3687,
    "lng": 99.8974
  },
  "หนองหญ้าไซ, สุพรรณบุรี": {
    "lat": 14.782,
    "lng": 99.8397
  },
  "เมืองนครปฐม, นครปฐม": {
    "lat": 13.8249,
    "lng": 100.0349
  },
  "กำแพงแสน, นครปฐม": {
    "lat": 14.0259,
    "lng": 99.9721
  },
  "นครชัยศรี, นครปฐม": {
    "lat": 13.8162,
    "lng": 100.1841
  },
  "ดอนตูม, นครปฐม": {
    "lat": 13.941,
    "lng": 100.097
  },
  "บางเลน, นครปฐม": {
    "lat": 14.0353,
    "lng": 100.1839
  },
  "สามพราน, นครปฐม": {
    "lat": 13.7317,
    "lng": 100.2351
  },
  "พุทธมณฑล, นครปฐม": {
    "lat": 13.83,
    "lng": 100.2827
  },
  "เมืองสมุทรสาคร, สมุทรสาคร": {
    "lat": 13.5378,
    "lng": 100.2506
  },
  "กระทุ่มแบน, สมุทรสาคร": {
    "lat": 13.6554,
    "lng": 100.2682
  },
  "บ้านแพ้ว, สมุทรสาคร": {
    "lat": 13.6027,
    "lng": 100.1257
  },
  "เมืองสมุทรสงคราม, สมุทรสงคราม": {
    "lat": 13.4072,
    "lng": 99.9981
  },
  "บางคนที, สมุทรสงคราม": {
    "lat": 13.4748,
    "lng": 99.9457
  },
  "อัมพวา, สมุทรสงคราม": {
    "lat": 13.4032,
    "lng": 99.9262
  },
  "เมืองเพชรบุรี, เพชรบุรี": {
    "lat": 13.0932,
    "lng": 99.9589
  },
  "เขาย้อย, เพชรบุรี": {
    "lat": 13.2388,
    "lng": 99.8141
  },
  "หนองหญ้าปล้อง, เพชรบุรี": {
    "lat": 13.132,
    "lng": 99.5882
  },
  "ชะอำ, เพชรบุรี": {
    "lat": 12.7849,
    "lng": 99.9051
  },
  "ท่ายาง, เพชรบุรี": {
    "lat": 12.9089,
    "lng": 99.8715
  },
  "บ้านลาด, เพชรบุรี": {
    "lat": 13.0519,
    "lng": 99.8861
  },
  "บ้านแหลม, เพชรบุรี": {
    "lat": 13.169,
    "lng": 99.989
  },
  "แก่งกระจาน, เพชรบุรี": {
    "lat": 12.8892,
    "lng": 99.5775
  },
  "เมืองประจวบคีรีขันธ์, ประจวบคีรีขันธ์": {
    "lat": 11.8297,
    "lng": 99.7303
  },
  "กุยบุรี, ประจวบคีรีขันธ์": {
    "lat": 12.1148,
    "lng": 99.847
  },
  "ทับสะแก, ประจวบคีรีขันธ์": {
    "lat": 11.5538,
    "lng": 99.5673
  },
  "บางสะพาน, ประจวบคีรีขันธ์": {
    "lat": 11.2656,
    "lng": 99.4694
  },
  "บางสะพานน้อย, ประจวบคีรีขันธ์": {
    "lat": 11.0592,
    "lng": 99.373
  },
  "ปราณบุรี, ประจวบคีรีขันธ์": {
    "lat": 12.3938,
    "lng": 99.8427
  },
  "หัวหิน, ประจวบคีรีขันธ์": {
    "lat": 12.521,
    "lng": 99.7869
  },
  "สามร้อยยอด, ประจวบคีรีขันธ์": {
    "lat": 12.2624,
    "lng": 99.7102
  },
  "เมืองนครศรีธรรมราช, นครศรีธรรมราช": {
    "lat": 8.4305,
    "lng": 99.9612
  },
  "พรหมคีรี, นครศรีธรรมราช": {
    "lat": 8.5326,
    "lng": 99.8246
  },
  "ลานสกา, นครศรีธรรมราช": {
    "lat": 8.3816,
    "lng": 99.7844
  },
  "ฉวาง, นครศรีธรรมราช": {
    "lat": 8.4673,
    "lng": 99.511
  },
  "พิปูน, นครศรีธรรมราช": {
    "lat": 8.5762,
    "lng": 99.6104
  },
  "เชียรใหญ่, นครศรีธรรมราช": {
    "lat": 8.1435,
    "lng": 100.1609
  },
  "ชะอวด, นครศรีธรรมราช": {
    "lat": 7.9575,
    "lng": 99.978
  },
  "ท่าศาลา, นครศรีธรรมราช": {
    "lat": 8.6785,
    "lng": 99.8882
  },
  "ทุ่งสง, นครศรีธรรมราช": {
    "lat": 8.1286,
    "lng": 99.6464
  },
  "นาบอน, นครศรีธรรมราช": {
    "lat": 8.26,
    "lng": 99.5383
  },
  "ทุ่งใหญ่, นครศรีธรรมราช": {
    "lat": 8.3006,
    "lng": 99.3669
  },
  "ปากพนัง, นครศรีธรรมราช": {
    "lat": 8.3028,
    "lng": 100.1669
  },
  "ร่อนพิบูลย์, นครศรีธรรมราช": {
    "lat": 8.1933,
    "lng": 99.9053
  },
  "สิชล, นครศรีธรรมราช": {
    "lat": 8.9387,
    "lng": 99.8359
  },
  "ขนอม, นครศรีธรรมราช": {
    "lat": 9.2237,
    "lng": 99.7983
  },
  "หัวไทร, นครศรีธรรมราช": {
    "lat": 8.0249,
    "lng": 100.2577
  },
  "บางขัน, นครศรีธรรมราช": {
    "lat": 7.9885,
    "lng": 99.475
  },
  "ถ้ำพรรณรา, นครศรีธรรมราช": {
    "lat": 8.457,
    "lng": 99.3797
  },
  "จุฬาภรณ์, นครศรีธรรมราช": {
    "lat": 8.0656,
    "lng": 99.8868
  },
  "พระพรหม, นครศรีธรรมราช": {
    "lat": 8.3285,
    "lng": 99.9255
  },
  "นบพิตำ, นครศรีธรรมราช": {
    "lat": 8.7185,
    "lng": 99.7448
  },
  "ช้างกลาง, นครศรีธรรมราช": {
    "lat": 8.3687,
    "lng": 99.6053
  },
  "เฉลิมพระเกียรติ, นครศรีธรรมราช": {
    "lat": 8.1937,
    "lng": 100.0337
  },
  "เมืองกระบี่, กระบี่": {
    "lat": 8.052,
    "lng": 98.8316
  },
  "เขาพนม, กระบี่": {
    "lat": 8.2725,
    "lng": 99.1422
  },
  "เกาะลันตา, กระบี่": {
    "lat": 7.6552,
    "lng": 99.0982
  },
  "คลองท่อม, กระบี่": {
    "lat": 7.9047,
    "lng": 99.1903
  },
  "อ่าวลึก, กระบี่": {
    "lat": 8.3708,
    "lng": 98.7558
  },
  "ปลายพระยา, กระบี่": {
    "lat": 8.5453,
    "lng": 98.8143
  },
  "ลำทับ, กระบี่": {
    "lat": 8.0188,
    "lng": 99.3475
  },
  "เหนือคลอง, กระบี่": {
    "lat": 8.0065,
    "lng": 99.0221
  },
  "เมืองพังงา, พังงา": {
    "lat": 8.4692,
    "lng": 98.514
  },
  "เกาะยาว, พังงา": {
    "lat": 8.028,
    "lng": 98.586
  },
  "กะปง, พังงา": {
    "lat": 8.7238,
    "lng": 98.4514
  },
  "ตะกั่วทุ่ง, พังงา": {
    "lat": 8.2736,
    "lng": 98.4127
  },
  "ตะกั่วป่า, พังงา": {
    "lat": 8.8287,
    "lng": 98.327
  },
  "คุระบุรี, พังงา": {
    "lat": 9.217,
    "lng": 98.281
  },
  "ทับปุด, พังงา": {
    "lat": 8.5215,
    "lng": 98.632
  },
  "ท้ายเหมือง, พังงา": {
    "lat": 8.4847,
    "lng": 98.3045
  },
  "เมืองภูเก็ต, ภูเก็ต": {
    "lat": 7.8509,
    "lng": 98.3684
  },
  "กะทู้, ภูเก็ต": {
    "lat": 7.921,
    "lng": 98.3117
  },
  "ถลาง, ภูเก็ต": {
    "lat": 8.0607,
    "lng": 98.3623
  },
  "เมืองสุราษฎร์ธานี, สุราษฎร์ธานี": {
    "lat": 9.1287,
    "lng": 99.3176
  },
  "กาญจนดิษฐ์, สุราษฎร์ธานี": {
    "lat": 9.1092,
    "lng": 99.4932
  },
  "ดอนสัก, สุราษฎร์ธานี": {
    "lat": 9.2185,
    "lng": 99.6548
  },
  "เกาะสมุย, สุราษฎร์ธานี": {
    "lat": 9.5073,
    "lng": 99.9431
  },
  "เกาะพะงัน, สุราษฎร์ธานี": {
    "lat": 9.7625,
    "lng": 100.0205
  },
  "ไชยา, สุราษฎร์ธานี": {
    "lat": 9.4176,
    "lng": 99.1554
  },
  "ท่าชนะ, สุราษฎร์ธานี": {
    "lat": 9.6043,
    "lng": 99.0397
  },
  "คีรีรัฐนิคม, สุราษฎร์ธานี": {
    "lat": 9.0263,
    "lng": 98.951
  },
  "บ้านตาขุน, สุราษฎร์ธานี": {
    "lat": 8.9787,
    "lng": 98.8275
  },
  "พนม, สุราษฎร์ธานี": {
    "lat": 8.8002,
    "lng": 98.7963
  },
  "ท่าฉาง, สุราษฎร์ธานี": {
    "lat": 9.2915,
    "lng": 99.0937
  },
  "บ้านนาสาร, สุราษฎร์ธานี": {
    "lat": 8.8049,
    "lng": 99.3665
  },
  "บ้านนาเดิม, สุราษฎร์ธานี": {
    "lat": 8.9057,
    "lng": 99.278
  },
  "เคียนซา, สุราษฎร์ธานี": {
    "lat": 8.7616,
    "lng": 99.1744
  },
  "เวียงสระ, สุราษฎร์ธานี": {
    "lat": 8.5974,
    "lng": 99.3458
  },
  "พระแสง, สุราษฎร์ธานี": {
    "lat": 8.5397,
    "lng": 99.1396
  },
  "พุนพิน, สุราษฎร์ธานี": {
    "lat": 9.0688,
    "lng": 99.1603
  },
  "ชัยบุรี, สุราษฎร์ธานี": {
    "lat": 8.4522,
    "lng": 99.0665
  },
  "วิภาวดี, สุราษฎร์ธานี": {
    "lat": 9.2395,
    "lng": 98.858
  },
  "เมืองระนอง, ระนอง": {
    "lat": 9.911,
    "lng": 98.5982
  },
  "ละอุ่น, ระนอง": {
    "lat": 10.0753,
    "lng": 98.7917
  },
  "กะเปอร์, ระนอง": {
    "lat": 9.5878,
    "lng": 98.6018
  },
  "กระบุรี, ระนอง": {
    "lat": 10.4361,
    "lng": 98.8279
  },
  "สุขสำราญ, ระนอง": {
    "lat": 9.4575,
    "lng": 98.376
  },
  "เมืองชุมพร, ชุมพร": {
    "lat": 10.4735,
    "lng": 99.1655
  },
  "ท่าแซะ, ชุมพร": {
    "lat": 10.7368,
    "lng": 99.1334
  },
  "ปะทิว, ชุมพร": {
    "lat": 10.7651,
    "lng": 99.34
  },
  "หลังสวน, ชุมพร": {
    "lat": 9.9463,
    "lng": 99.0832
  },
  "ละแม, ชุมพร": {
    "lat": 9.7557,
    "lng": 99.0295
  },
  "พะโต๊ะ, ชุมพร": {
    "lat": 9.84,
    "lng": 98.823
  },
  "สวี, ชุมพร": {
    "lat": 10.2424,
    "lng": 99.0529
  },
  "ทุ่งตะโก, ชุมพร": {
    "lat": 10.1172,
    "lng": 99.0678
  },
  "เมืองสงขลา, สงขลา": {
    "lat": 7.1335,
    "lng": 100.6055
  },
  "สทิงพระ, สงขลา": {
    "lat": 7.4842,
    "lng": 100.4225
  },
  "จะนะ, สงขลา": {
    "lat": 6.8962,
    "lng": 100.6984
  },
  "นาทวี, สงขลา": {
    "lat": 6.6661,
    "lng": 100.6773
  },
  "เทพา, สงขลา": {
    "lat": 6.8021,
    "lng": 100.9203
  },
  "สะบ้าย้อย, สงขลา": {
    "lat": 6.5589,
    "lng": 100.9377
  },
  "ระโนด, สงขลา": {
    "lat": 7.7679,
    "lng": 100.3264
  },
  "กระแสสินธุ์, สงขลา": {
    "lat": 7.6013,
    "lng": 100.322
  },
  "รัตภูมิ, สงขลา": {
    "lat": 7.1172,
    "lng": 100.222
  },
  "สะเดา, สงขลา": {
    "lat": 6.701,
    "lng": 100.4233
  },
  "หาดใหญ่, สงขลา": {
    "lat": 7.0057,
    "lng": 100.4642
  },
  "นาหม่อม, สงขลา": {
    "lat": 6.949,
    "lng": 100.557
  },
  "ควนเนียง, สงขลา": {
    "lat": 7.1975,
    "lng": 100.3755
  },
  "บางกล่ำ, สงขลา": {
    "lat": 7.0895,
    "lng": 100.4325
  },
  "สิงหนคร, สงขลา": {
    "lat": 7.2772,
    "lng": 100.488
  },
  "คลองหอยโข่ง, สงขลา": {
    "lat": 6.8682,
    "lng": 100.3678
  },
  "เมืองสตูล, สตูล": {
    "lat": 6.6379,
    "lng": 100.0166
  },
  "ควนโดน, สตูล": {
    "lat": 6.7745,
    "lng": 100.0965
  },
  "ควนกาหลง, สตูล": {
    "lat": 6.909,
    "lng": 100.0353
  },
  "ท่าแพ, สตูล": {
    "lat": 6.809,
    "lng": 99.9183
  },
  "ละงู, สตูล": {
    "lat": 6.9085,
    "lng": 99.7842
  },
  "ทุ่งหว้า, สตูล": {
    "lat": 7.0466,
    "lng": 99.75
  },
  "มะนัง, สตูล": {
    "lat": 6.994,
    "lng": 99.9325
  },
  "เมืองตรัง, ตรัง": {
    "lat": 7.58,
    "lng": 99.6132
  },
  "กันตัง, ตรัง": {
    "lat": 7.4166,
    "lng": 99.5056
  },
  "ย่านตาขาว, ตรัง": {
    "lat": 7.4266,
    "lng": 99.7234
  },
  "ปะเหลียน, ตรัง": {
    "lat": 7.247,
    "lng": 99.7213
  },
  "สิเกา, ตรัง": {
    "lat": 7.5934,
    "lng": 99.34
  },
  "ห้วยยอด, ตรัง": {
    "lat": 7.7928,
    "lng": 99.5902
  },
  "วังวิเศษ, ตรัง": {
    "lat": 7.721,
    "lng": 99.4254
  },
  "นาโยง, ตรัง": {
    "lat": 7.5567,
    "lng": 99.728
  },
  "รัษฎา, ตรัง": {
    "lat": 7.9463,
    "lng": 99.6427
  },
  "หาดสำราญ, ตรัง": {
    "lat": 7.1907,
    "lng": 99.5327
  },
  "เมืองพัทลุง, พัทลุง": {
    "lat": 7.6038,
    "lng": 100.0653
  },
  "กงหรา, พัทลุง": {
    "lat": 7.4434,
    "lng": 99.947
  },
  "เขาชัยสน, พัทลุง": {
    "lat": 7.4654,
    "lng": 100.1224
  },
  "ตะโหมด, พัทลุง": {
    "lat": 7.292,
    "lng": 100.0593
  },
  "ควนขนุน, พัทลุง": {
    "lat": 7.7432,
    "lng": 100.0325
  },
  "ปากพะยูน, พัทลุง": {
    "lat": 7.3271,
    "lng": 100.3173
  },
  "ศรีบรรพต, พัทลุง": {
    "lat": 7.6973,
    "lng": 99.8583
  },
  "ป่าบอน, พัทลุง": {
    "lat": 7.2474,
    "lng": 100.1536
  },
  "บางแก้ว, พัทลุง": {
    "lat": 7.4253,
    "lng": 100.1663
  },
  "ป่าพะยอม, พัทลุง": {
    "lat": 7.823,
    "lng": 99.8685
  },
  "ศรีนครินทร์, พัทลุง": {
    "lat": 7.554,
    "lng": 99.9155
  },
  "เมืองปัตตานี, ปัตตานี": {
    "lat": 6.8545,
    "lng": 101.2708
  },
  "โคกโพธิ์, ปัตตานี": {
    "lat": 6.7051,
    "lng": 101.1208
  },
  "หนองจิก, ปัตตานี": {
    "lat": 6.802,
    "lng": 101.1859
  },
  "ปะนาเระ, ปัตตานี": {
    "lat": 6.8071,
    "lng": 101.5088
  },
  "มายอ, ปัตตานี": {
    "lat": 6.7208,
    "lng": 101.3998
  },
  "ทุ่งยางแดง, ปัตตานี": {
    "lat": 6.628,
    "lng": 101.4475
  },
  "สายบุรี, ปัตตานี": {
    "lat": 6.6989,
    "lng": 101.5774
  },
  "ไม้แก่น, ปัตตานี": {
    "lat": 6.626,
    "lng": 101.6607
  },
  "ยะหริ่ง, ปัตตานี": {
    "lat": 6.8261,
    "lng": 101.3941
  },
  "ยะรัง, ปัตตานี": {
    "lat": 6.7339,
    "lng": 101.3038
  },
  "กะพ้อ, ปัตตานี": {
    "lat": 6.6037,
    "lng": 101.5397
  },
  "แม่ลาน, ปัตตานี": {
    "lat": 6.6697,
    "lng": 101.237
  },
  "เมืองยะลา, ยะลา": {
    "lat": 6.5472,
    "lng": 101.2362
  },
  "เบตง, ยะลา": {
    "lat": 5.8152,
    "lng": 101.17
  },
  "บันนังสตา, ยะลา": {
    "lat": 6.2447,
    "lng": 101.2765
  },
  "ธารโต, ยะลา": {
    "lat": 6.1318,
    "lng": 101.2227
  },
  "ยะหา, ยะลา": {
    "lat": 6.4804,
    "lng": 101.1306
  },
  "รามัน, ยะลา": {
    "lat": 6.4798,
    "lng": 101.4168
  },
  "กาบัง, ยะลา": {
    "lat": 6.3895,
    "lng": 101.0115
  },
  "เมืองนราธิวาส, นราธิวาส": {
    "lat": 6.3879,
    "lng": 101.8146
  },
  "ตากใบ, นราธิวาส": {
    "lat": 6.2265,
    "lng": 102.0224
  },
  "บาเจาะ, นราธิวาส": {
    "lat": 6.5438,
    "lng": 101.6405
  },
  "ยี่งอ, นราธิวาส": {
    "lat": 6.4115,
    "lng": 101.6932
  },
  "ระแงะ, นราธิวาส": {
    "lat": 6.2785,
    "lng": 101.7073
  },
  "รือเสาะ, นราธิวาส": {
    "lat": 6.3819,
    "lng": 101.5218
  },
  "ศรีสาคร, นราธิวาส": {
    "lat": 6.2165,
    "lng": 101.5145
  },
  "แว้ง, นราธิวาส": {
    "lat": 5.9187,
    "lng": 101.859
  },
  "สุคิริน, นราธิวาส": {
    "lat": 5.931,
    "lng": 101.739
  },
  "สุไหงโกลก, นราธิวาส": {
    "lat": 6.0698,
    "lng": 101.9922
  },
  "สุไหงปาดี, นราธิวาส": {
    "lat": 6.0725,
    "lng": 101.878
  },
  "จะแนะ, นราธิวาส": {
    "lat": 6.0823,
    "lng": 101.6593
  },
  "เจาะไอร้อง, นราธิวาส": {
    "lat": 6.229,
    "lng": 101.84
  }
};
